{"pages":[{"title":"Yotaro Takazawa (高澤 陽太朗)","text":"Research Areas Operations research Combinatorial Optimization Approximation Algorithms Curriculum VitaeExperience Oct 2019 - Present: Assistant ProfessorDepartment of Industrial and Systems Engineering, Aoyama Gakuin University @Kanagawa, Japan Oct 2018 - Sep 2019: AI Engineer (intern)Mercari, Inc. @Tokyo, Japan Mar 2016 - Aug 2019: Algorithm Engineer (intern)PKSHA Technology @Tokyo, Japan Education Sep 2019: Doctor of Engineering from Department of Industrial Engineering and Economics, School of Engineering, Tokyo Institute of Technology. Mar 2017: Master of Engineering from Department of Industrial Engineering and Management, Graduate School of Decision Science and Technology, Tokyo Institute of Technology. Mar 2015: Bachelor of Engineering from Department of Industrial and Systems Engineering, Faculty of Engineering, Tokyo Institute of Technology. Research AchievementsRefereed Papers in Journals Y. Takazawa, S. Mizuno, T. Kitahara, “Approximation algorithms for the covering-type k violation linear program”, Optimization Letters, accepted. Y. Takazawa, S. Mizuno, T. Kitahara, “An improved approximation algorithm for the covering 0-1 integer program”, Pacific Journal of Optimization, accepted. Y. Takazawa, S. Mizuno, T. Kitahara, “An approximation algorithm for the partial covering 0-1 integer program”, Discrete Applied Mathematics, in press [URL]. Y. Takazawa, S. Mizuno, “A 2-approximation algorithm for the minimum knapsack problem with a forcing graph”, Journal of Operations Research Society of Japan, 60.1 (2017), 15-23. [PDF] Conference Y.Takazawa, S. Mizuno, T. Kitahara, “Approximation algorithms for covering problems”, First Conference onDiscrete Optimization and Machine Learning, Tokyo, Japan, July 2018. Y. Takazawa, S. Mizuno, T. Kitahara, “Approximation Algorithms for the covering-type linear programming with violations”, 2018 INFORMS International Conference, Taipei, Taiwan, June 2018. Y. Takazawa, S. Mizuno, T. Kitahara, “An improve approximation algorithm for the covering 0-1 integer program”, The Second Pacific Optimization Conference (POC 2017), Perth, Australia, December 2017. Y. Takazawa, S. Mizuno, T. Kitahara, “An approximation algorithm for the partial covering 0-1 integer program”, SIAM Conference on Optimization, Vancouver, Canada, May 2017. Contacttakazawa [AT] ise.aoyama.ac.jp or Twitter","link":"/english/index.html"},{"title":"About...","text":"東京都墨田区生まれ・育ち・在住のYotaroです． 日記兼メモ兼ブログです．","link":"/about/index.html"}],"posts":[{"title":"Selenium利用時にIPアドレスを毎アクセス変えたい","text":"pythonでseleniumを利用時に，毎アクセスIPアドレスを変えれないのか? というモチベーションを持っている人は多いと思う．それは以下の方法で（たぶん）実現可能．Pythonだけど，Pythonじゃなくてもほぼおなじかと．基本的に参考のリンク先を読めばわかるが，日本語の情報があまりなかったので一応共有． 1. Tor Browserをインストールこちらからインストールする． 2. Tor Browserを起動selenium利用時は常に起動しておく． 3. Seleniumを使う以下のprofileを渡して実行．もしうまくいかない場合はTor Browserの右上の設定ボタンから「Preferences/Advanced(タブ)/Network(タブ)/Connection/Settings」が↓の設定と整合的かを確認する． 12345678910from selenium import webdriverfirefox_profile = webdriver.FirefoxProfile()firefox_profile.set_preference(&apos;network.proxy.type&apos;, 1)firefox_profile.set_preference(&apos;network.proxy.socks&apos;, &apos;127.0.0.1&apos;)firefox_profile.set_preference(&apos;network.proxy.socks_port&apos;, 9150)browser = webdriver.Firefox(firefox_profile=firefox_profile)# チェックbrowser.get(&quot;https://takazawa.github.io/&quot;) 確認確認のために自分のウェブサイトにアクセスして位置情報を見たところParisになっていた． 参考 http://www.onurvarol.com/blog/web-scraper-with-no-ip-limit-problem/","link":"/hobby/selenium_python_tor/"},{"title":"ベネクス(VENEX)は効果があるのか？","text":"1. はじめにベネクスとは着ると体力が回復する（しやすくする）という特性を持った商品である．友人にこの商品の存在を教えてもらって興味を持ち，買おうと思っていたが，いかんせん価格が非常に高く（Tシャツで1〜2万円）ノリで買うにはちょっときつい．さらに，自分はこういうような生物系（？）のことは無知なため，さすがにもう少し調べてから購入しようという気持ちになった．が，ネットで調べても出てくるのは個人の感想ばかりであまり参考にならない（ただ高評価が多い気はしている！）．ということで，ここではベネクスのウェブページの情報等をもとに調べたことをまとめる． 2. そもそもベネクスはなぜ良いのか?公式ページによると， リカバリーウェアにはベネクスが開発した素材であるPHT（Platinum Harmonized Technology）を使用しています。休養時のカラダを考えて独自開発したされたこの素材は、プラチナなどの鉱物を繊維1本1本に練り込んで作られるメイド・イン・ジャパンの新機能マテリアル。その機能性は国内外の15以上の大学や研究機関との共同研究によって証明され、すでに多くの論文が発表されています。 というようなことが書かれている．つまり，PHT（Platinum Harmonized Technology）という技術がベネクスをベネクスたらしめるていると考えてよいだろう．となると，次のステップはPHTについて調べる，ということが自然だ． 話はすこしそれるが，実際に公式ページでは研究成果となる論文も公開している．これの一つ目を見ると， DPV576 繊維素材製スパッツを着用することによって筋トルクの低減を抑制、改善することがわかりました。 というようなことが書いてある．正直この手の内容は全く理解できなかったがこの時点で思った疑問としては， 疑問1：DPV576という繊維素材(?)とPHTの関係性はなんなのか． 疑問2：多くの論文と書いてあるがこれがすべてなのか． 3. PHTを調べるとりあえず，PHTについて調べることにした．というのも，以下の引用の通りであれば，論文等が沢山あるはずと思ったためだ． その機能性は国内外の15以上の大学や研究機関との共同研究によって証明され、すでに多くの論文が発表されています。 まずはじめに，普段使うGoogle ScholarでPHTを検索してみることにした．研究者以外の人はGoogle Scholarというサービスになじみがたぶんないと思うけれど，グーグル検索の論文検索版サービスで，ほとんどすべての論文はここから調べられると思う．いざ調べてみると，おや，ひとつしか出てこない．しかも2017年10月というかなり最近の論文．だれでも読める論文誌(基本的に論文を読むのにはお金がかかる)であったため，とりあえずこれを読んでみようと決意． 4. 最近のVENEX関連論文を紹介対象論文 Zinke Fridolin, Patrick Bakenecker, and Daniel Hahn. “Influence of platinum harmonized textile on neuromuscular, systemic and subjective recovery.” PloS one 12.10 (2017): e0186162. http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0186162 以下あっているかわからないけれどサマリー被験者にいくつかの運動をした後に，VENEX or 似たようなプラセボ商品を着せて，数日後に筋力回復具合を以下の3項目の値を計測して，VENEXがこれらの項目を改善するかどうかを評価した． neuromuscular parameters (神経筋パラメータ) 副交感神経系といった身体の回復に関係のある神経をチェックしたのだろう(テキトウ) systemic parameters (全身パラメータ) これはたぶん実際の運動能力がどれくらいもとにもどっているかをチェックしているのかと． subjective parameters (主観的パラメータ) これは被験者自身がどれくらい回復しているかを主観的に評価したものかと． 実験をしてみたところ，上記３つの項目でVENEXと似たようなプラセボ商品では大きな差はなかった（有意差はなかった）．ただ，3.主観的なパラメータでは有意差はないものの効果はあった． 感想結局，筋力の回復にはほとんど効果はなかったということなのでは？．．．得られた結果は，過去の(日本の方の)VENEXに関しての研究結果と異なる結果を示している的なことも書いてあったし，若干効果に疑念が．．． というか，そもそも実はこんなことを調べずとも，今回得られた結論は公式サイトに載っていたのである！ Q. 筋肉の疲労に効きますか？ A. 着用のみによる疲労回復効果はございませんが、着用しながらマッサージすることで、直接肌を傷めずに筋肉をほぐすことができるなどのお声を多くいただいております。 そう，着用による疲労回復はないのである．さらにこんな質問も， Q. 疲労を回復する効果があるのですか？ A. ベネクスリカバリーウェアは、着て休むことで、人間が本来持っている自己回復力を最大限に発揮させることを目的に開発された、休養時専用ウェアです。 Yes or No質問にこの答え方だとゼミ発表で炎上しそうな予感が．．．伊藤園の水素水の質問コーナーと雰囲気が似ている． Q6. どんな健康効果がありますか？ A6. 伊藤園が販売する水素水は医薬品ではないため、健康効果を標ぼうするものではありません。 Q9.なぜ水素水を販売しているのですか？ A9.水分補給の1つの選択肢として販売しております。 さきほどの疑問の答え PHTはDPV576という繊維を使った技術という立ち位置っぽい．なので，PHTで検索しても論文が出てこないのもある程度納得はいく（DPV576ではいくつかある）． 5. 私の結論 VENEXに疑念を持たずに着れば，なにか効果はあるのかも．自分は若干の疑いを持ってしまったため無理な気が．．．．やはり，信じる心が大事． 実際に，Twitterで検索してみると効果を感じている人は多く，精神的な効果を含めて何らかの効果はあるような気もしている． 今回の実験では効果を観測できなかっただけであって，今後の研究で「やっぱり効果ある」というような結果が得られるかもしれない．","link":"/hobby/venex/"},{"title":"完全無欠コーヒー作成のためのTips","text":"はじめにこのページは完全無欠コーヒーを作るにあたって，多くのブログ等で紹介されている方法に疑問を感じたため作成した．完全無欠コーヒーは「[シリコンバレー式 自分を変える最強の食事](シリコンバレー式 自分を変える最強の食事 )」という本で紹介され，パフォーマンス向上およびダイエット効果があるとして市民権を得た．完全無欠コーヒーは基本的には コーヒー グラスフェッドバター or ギー(Ghee) MCTオイル を混ぜてできるコーヒーだ．ただ，従来のウェブサイトでは作成に関していくつかの手抜きをしている．たとえば，著者はコーヒーにこだわれと言っているのに対して，なぜかインスタントコーヒーを使い，あたかもそれが良いかのような記事を書いていたりする．ただ，思い出してほしい．本で紹介されていた作り方は，著者が長年かけて考えたベストの方法であると．そして考えてほしい，よくわからない怪しいブロガーが急にオリジナリティを出した作成方法は信用に足るのかと． ということで，ここでは 本に即して ，完全無欠コーヒーの作る際のTipsや注意したい点を述べる． 注意 おそらく読者は完全無欠コーヒーの作り方はわかっているので，ここでは作り方を詳しくは述べない．もし気になる場合はこちらの動画が最も参考になるだろう．あと，ブロガーたちの作り方を否定しているわけではない．というのも，コーヒーをきちんとした手順で作ることがめんどくさいと感じることは私もしばしばある．そのため，簡易的に作るという発想は自然だと思う．ただ，本当にその方法で効果があるのか？ということが私にはわからない．おそらく，これを読んでいる人は本を読んで，著者を信じて作ろうとしていると思う．とすると，やはり，著者が良いと確信した正規の作り方を実践したほうがよいのではないかと，私は思う． Tip材料系は基本iHerbという海外のサプリ・食品を扱っているAmazon的なサイトでお得に購入できる．海外っぽい雰囲気で一瞬戸惑うが普通に使いやすいサービスだと思う． Tips 1： コーヒー豆本では基本的には以下の基準でおすすめをしている(p.127)．おそらくカビ毒の量の低減が目的 近所で一番の高級店か信頼できる店で買う． 単一産地の豆のほうがよい．（更に中米のほうがよい） 注意利便性からインスタントコーヒーをおすすめしたりしているブログをちらほらみる．本で直接言及されているわけではないが，上記項目を考慮するとインスタントコーヒーは良くないのでは？と思う．味の観点からも微妙かと．さらにTips 2にも関連する． Tipこれらの観点から自分がチョイスしたのはペルー産のMt. Whitney Coffee Roasters, Organic Peru, Medium Roast Whole Bean Coffeeというコーヒー．ただ，個人的には完全無欠コーヒーは深煎りのコーヒー豆が合うと思う．味という観点で一番美味しかったのはKicking Horse Coffeeという会社のこのコーヒーだった．あと，個人的には香りも重要と思うため毎回挽いている．豆の保存にはこれを利用． Tips 2：コーヒーをいれる本ではコーヒーに含有される油脂が重要と説いている．そのため，金属系のフィルターを利用したもので淹れると良いと本には書かれている． Tip完全無欠コーヒーを淹れるためには基本的に金属フィルターかフレンチプレスの二択となる．ちなみに，私はAmazonで買ったフレンチプレスを利用している． Tips 3：混ぜる本では，吸収の観点からバターやオイルをしっかり溶かし合わせることが重要といっている． 小言簡易性からミルク泡立て器の利用をおすすめしているブログをよくみる．実は私もはじめはめんどくさくブログの誘惑に負けてこちらを利用していた．一見混ざっているように見えるが，ブレンダー利用時と味と見た目が全然違うので，本当にやめたほうがいい．実際に，著者が完全無欠コーヒーのインスピレーションをもらった遊牧民たちは（邪魔になるにもかかわらず）重いブレンダーや撹拌機を持っていたらしい． OthersちなみにいつもギーとMCTは以下を利用． https://www.iherb.com/pr/Pure-Indian-Foods-Ghee-100-Organic-Grass-Fed-15-oz-425-g/65370 https://www.iherb.com/pr/Jarrow-Formulas-MCT-Oil-20-fl-oz-591-ml/68705","link":"/hobby/bulletproof_coffee/"},{"title":"Python(scikit-learn)でNMFを利用したレコメンド","text":"scikit-learnを利用したNMF利用の方法の解説の記事はいくつかあったのですが，実際の用途にあった記事がみつからなかったためメモとして残します． ざっくりとしたタスクまずNMFとか抜きに扱うタスクを説明します． (既存)ユーザー×商品のレーティングの行列 (学習データ，大量にあるイメージ)が与えられたときに，何らかの学習モデルを作っておき（時間がかかっても良い）， (新規 or ターゲット)ユーザー×商品のレーティングの行列（検証データ，少量）が新しく得られたときに，レーティングしていない商品の値を（高速に）出して，値が高い商品をレコメンドをしたい． （あまりこの枠組でscikit-learnのNMFの使い方を書いている人がいないのでメモしました．） NMFによる実現上記のタスクはNMFを利用する場合どのようにして実現されるのかという話をします． 1.学習(既存)ユーザー×商品のレーティングの行列を$X$とします．そうすると，何らかの学習モデルを作るということは，NMFでは$W$の列（$H$の行）ベクトルの数をパラメータとして与えたもと $$X \\simeq W \\times H$$ となるような$W$と$H$を作るということになります．ここで以下のような解釈が可能です． $W$はユーザー×特徴の行列で，ユーザーごとの特徴を意味 $H$は特徴×商品の行列で，商品ごとの特徴を意味 ここで大事なこととしては，$H$は商品ごとの特徴を表しているため，今後もデータの特徴が大きく変わらないとすれば新しいデータ等が来ても変わらない値と考えらます．(ex. もしホラーの映画に対して，ホラーという特徴が取れたとするとこの特徴は今後も変わらない)したがってNMFにおいては行列$H$が学習モデルと捉えることができると思います． ちなみに，この時点で得られた$W$と$H$を使ってあげて$$X’ = W \\times H$$のように$X’$を計算してあげることによって，既存ユーザー相手にはレコメンド可能となっています（$X$において0だった要素に$X’$においては正の値が入る場合があるため）． NMFの多くの記事ではこの話がメインでした． 2.予測では，ここで新しく(新規 or ターゲット)ユーザー×商品のレーティングの行列が得られたとして，これを$X_{\\text{new}}$としましょう．このとき，上で求めた$X’$のようなものを$X_{\\text{new}}$に対して求めてあげるというのが目的です． NMFの予測フェーズでは，$H$をインプットとして$$X_{\\text{new}} \\simeq W_{\\text{new}} \\times H$$となるような$W_{\\text{new}}$を求めます．ここで先ほどとの違いを説明すると，学習時は $X \\simeq W \\times H$となる$W$と$H$を求めていたのに対して，今回は$H$は動かさずに$W_{\\text{new}}$だけを求めています．ここで新しいユーザーの特徴行列$W_{\\text{new}}$が得られたため，これを使って$$X_{\\text{new}} ‘ = W_{\\text{new}} \\times H$$を計算してあげます．$X_{\\text{new}}’$の0の部分が非負の値で埋まっているため，ユーザーごとにこの値が高い商品をレコメンドすればよいという結果です． Python(scikit-learn)による実装上記の話をPythonにて実装します．scikit-learnを利用するため以下のようにインポートします．インプットのデータの$X$はテキトウに作りました． 1234567891011121314151617import numpy as np from sklearn.decomposition.nmf import non_negative_factorizationnum_users = 10000num_items = 100# 0と1からなるの行列X = np.random.randint(0, 1, size = [num_users, num_items], dtype = 'int')``` #### 1.学習学習は次のように行います．その他のパラメータは[ドキュメント](https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.NMF.html)を参照ください．```pythonn_components = 3 # 特徴量の数（自分で決める）W, H, n_iter = non_negative_factorization(X, n_components=n_components) $X’$は以下で求めらます． 1X_predict = np.dot(W,H) 2.予測新しいユーザーデータ100件に対してレコメンドします． 12num_new_users = 100X_new = np.random.randint(1, 2, size = [num_new_users, num_items], dtype = 'int') $W_{\\text{new}}$を以下で求めます．学習で求めた$H$を渡すこととupdate_H=Falseとすることで$H$を固定しています． 1234W_new, H, n_iter = non_negative_factorization(X_new, H=H, update_H=False, n_components=n_components) 最終的にほしかった$X_{\\text{new}}’$は以下で求められます． 1X_new_predict = np.dot(W_new, H)","link":"/hobby/nmf_sklearn/"},{"title":"PandasのDataFrameのappendの高速化","text":"pandas.DataFrame.appendがかなり遅いときの対策メモ タスク空の\bDataFrameに\b\b大量の\bDataFrame(or Series)を付け加える． 今回は例として，以下の空のdf_dataに(2×3の)df_addを1万個付け加える．（本当はdf_addは毎回違うデータと思うが今回は例なので同じものを付け加える想定） 123456import pandas as pddf = pd.DataFrame()df_add = pd.DataFrame([[1, 2, 3], [4, 5, 6]])# タスク# dfにdf_addを1万回くっつける 1. DataFrame.appendによる実現（遅い)12345df = pd.DataFrame()df_add = pd.DataFrame([[1, 2, 3], [4, 5, 6]])for i in range(10000): df = df.append(df_add, ignore_index=True) これは\b結構時間がかかる．（dfが毎回コピーされるため?） 2. DataFrame.from_dictによる実現（速い）1234567891011df = pd.DataFrame()df_add = pd.DataFrame([[1, 2, 3], [4, 5, 6]])counter = 0dict_tmp = {}for i in range(10000): for _, row in df_add.iteritems(): dict_tmp[counter] = row counter += 1df = df.from_dict(dict_tmp, orient=\"index\") 空の辞書を作ってあげて，\bそこにkey=counterとしてpandas.Seriesを追加していく．最後にpandas.DataFrame.from_dictによって辞書からDataFrameを作る．\b動かしてみたら\bわかるがこちらのほうがだいぶ速い． !!! Tip 今回\bはdf_addをSeriesにするためにiteritems()\u0005を使っている． 参考リンク https://stackoverflow.com/questions/27929472/improve-row-append-performance-on-pandas-dataframes https://aniharu.hatenablog.com/entry/2017/12/17/172753","link":"/hobby/pandas_append_fast/"},{"title":"pipreqsを利用してrequirements.txtをスマートに作成","text":"pipreqsを利用すると現在のプロジェクトに必要なパッケージのみから構成される「requirements.txt」を作成できる． Why not pip freeze?[Google翻訳] pip freezeはあなたの環境に pip installでインストールされたパッケージだけを保存します。 pip freezeは、現在のプロジェクトで使用しないパッケージを含め、環境内のすべてのパッケージを保存します。 （もしあなたがvirtualenvを持っていないなら） モジュールをインストールせずに新しいプロジェクトのrequirements.txtを作成するだけでよい場合もあります。 インストール1pip install pipreqs 使い方プロジェクトのルートディレクトリで以下を実行するとrequirements.txtが生成される． 1pipreqs . 補足1: 通常のrequirements.txtの出力方法出力 (https://pip.pypa.io/en/stable/reference/pip_freeze/) pip freeze &gt; requirements.txt インストール (https://pip.pypa.io/en/stable/reference/pip_install/) pip install -r requirements.txt 補足2: pigar似たようなことができるライブラリ https://github.com/damnever/pigar","link":"/hobby/pipreqs/"},{"title":"ホワイトボードリアルタイム共有 (Google Jamboard)","text":"iPad Proの12.9インチモデルを最近買ったこともあり，Googleドキュメントのようにリアルタイムで共同編集可能なホワイトボードっぽいソフトはないか調べてみた． まさしくドンピシャであったのが無料でGoogle製の Google Jamboard ！（なぜかネットで全く話題になっていないので皆で普及させましょう） Web (https://jamboard.google.com/) iOS App (https://itunes.apple.com/us/app/jamboard/id1143591418) 良いところ Googleアカウントさえあれば良い． Google Driveで共有等便利 悪いところ 知名度がない（はじめiOS APPがどこにあるかもわからなかった） 一瞬有料かと思う（日本語記事だとそういう話ばっかりヒットした）","link":"/hobby/google_jamboard/"},{"title":"個人ページ作成する方法のメモ","text":"個人ページ作成する方法のメモこのページはMkDocsというツールを使って作りました．HTMLがわからなくてもそれなりのページが作成できるので博士の学生などで個人ページを作りたいという人にはとてもよいと思います．基本的には pythonが入ってる(文法は全く知らなくても良い) pipが使える ができれば作成できます．ここにいろいろ詳しく書こうと思いましたが，基本的には公式サイトを読めばわかります． MkDocs役に立ちそうなリンクを置きます． http://qiita.com/keitarou/items/065d4311439cc6b6847d http://stepxstep.org/blog/2014/06/12/mkdocs/ MarkdownMkdocsはマークダウンとよばれる言語で書きます．言語と言ってもかなり簡単です． http://qiita.com/Qiita/items/c686397e4a0f4f11683d GitHub PagasWebページを置く場所がないという人 or 大学などに置きたくないという人はGitHub Pagesを使うとよいかもしれません．無料で簡単なウェブページを置くことができます．実際このサイトもそうです．使う場合は若干のGitHubのコマンドをわかっていないと難しいかもしれません．一応，MkdocsにもGithub Pagesに対応したデプロイのコマンドもあります． このサイトをベースにしたいこのサイトをダウンロードして編集して使ってもらっても構いません．こちらへ飛んで，「Clone or download」というボタンを押せばダウンロードできます．","link":"/hobby/mkdocs/"},{"title":"2018年8月","text":"8月29-31日本部SSOR2018に参加してきた．発表無しでの参加ということもあり，かなり気軽な気持ちでいけた． 結論から言うとかなり有意義に過ごせた．(実行委員の方々運営ありがとうございました．) SSORの目的のひとつは交流ということもあり，先生・学生・企業の人等いろいろな人と話す良い機会となった． （講演で）一番印象に残ったのは吉良先生らによる「保育所の利用調整: きょうだい同所希望への配慮と展開形ゲーム」という題の講演だった．ここ数年問題となっている保育所の問題をORを使って分析していた．もっとすごいところは，分析だけではなく実際にこのアルゴリズムが使われる段階まで持っていっているところ！社会問題の分析をしている人は数多くいるが，実際に利用されるまでもっていかれる研究は少ない気がしている．ニュースをみて解決できそうな気がした的な話もカッコよい笑 8月25日来月水野先生の今年度で終わる(?)科研費のワークショップが開催される． 水野研のD1の橋本くんや自分がB4のときにお世話になった中田研OBの小林さんも発表するようだ． 実はこの科研費の始まりの方のワークショップ(2014年)も自分は参加していたこともあり，時の経過を感じた．当時はB4で研究室配属されて，はじめての研究活動の参加だったことを覚えている． こちらの方では最適化分野の有名人(?)Rockafellar先生が招待講演でいらしていた．当時は英語の発表を初めて聞くこともあり，さっぱりであった．これは先生の発表が悪いというわけではなく自分の方に問題があったと今では思う(当たり前かもしれないが)．というのも，去年オーストラリアの学会に参加した時，偶然にもまたもやRockaflellar先生の講演を聞くことができた．そのときは，技術的に細かい話はよくわからなかったが，研究のストーリー等は他の発表者と比べてもかなりわかりやすい説明だった．このときわかりやいと思えたのは，学会等で多くの発表を見て，研究の型や発表の型？のようなものがストックされたことが大きいのかなと．普通の人がわかりやすいと思う発表と研究者がわかりやすいと思う発表はちょっと違うよね． あとは，質疑応答のときに先生方がいろいろバトルしていた記憶があるけれどあれは単純に議論していただけだったなと今では思う． 8月13日実は今日から有志輪読をすることになっていた．勢いで声をかけたところ，結果的に第一回は水野・中田・塩浦研の学生が参加することになり，お盆休みの中わりと大人数のゼミとなった．ちなみに今日は西９号館のエレベータが停止していたため一苦労ではあった． 輪読する本は計算理論の基礎という計算理論に関する基礎的な本だ．自分のような経営システム工学科出身の学生（ただ不勉強なだけ？）はこういう情報系の基礎知識が乏しいため，夏休みに勉強するのにはいいのでは？という気持ちとなり，この本をチョイスした．博士学生はこれくらい知っておけ！という声が近くの先生から飛んできそうだけれど，とりあえず恥を捨てて勉強しよう．． 経営システム工学科は他専攻と比べて学部教育では専門知識が増えにくい傾向はあるけど，そこがいいところでもあるよね． 8月4-5日土日だったが研究室でいろいろ作業した．最近思ったけれど土日のほうが電車が空いていて快適に生きれる．そもそも自分は平日とか土日とか関係ない生活をしているので土日に活動するのもありかなと思えた． 後輩の研究の手伝いでPythonの（グラフ理論の）グラフ操作が便利なNetworkXというライブラリをいじったがかなり便利だ．グラフを扱う際に必要な処理がほとんど実装されており，アルゴリズム実装や描写がかなりスムーズに行えた． そいうえばSSORの振込をしたら，この支出はマネーフォワード（家計簿アプリ）に「自動車・ガソリン代」という自動分類がされていた．「SSOR」or「オクノ」が何らかの車関連の意味を持っていたのかな．（支出に車の項目が唐突に増えていたため，見た瞬間はかなり焦った．） 8月3日論文ゼミのために大学へいった． 8月1日ドニー・イェン来日イベントに水野研学生および中田研OBと参加した．","link":"/diary/2018/diary_201808/"},{"title":"2019年4月","text":"4月14日https://cloud.watch.impress.co.jp/docs/event/1179753.html GoogleのAutoML(Web上で機械学習できるツール)が更に進化するらしい． 一度画像分類に使ってみたが使いやすさでいったらかなりのレベルだと思う．精度もチューニングなしでそれなりという話も聞いた．なんなら，自分とか機械学習のプロではない人はこれを上手く使いこなせるほうが良い製品が作れそうな気すらする．． 今度試しに使ってみるか〜 4月12日今日から論文ゼミが始まったのだけれど，人数増加の関係からB4〜D3全員が一緒のゼミとなった． 留学生の人数もかなり増えて水野研は突然英語利用頻度が増えるという事態に．自分は留学経験も特に無いためこういう強制的な機会があると英語上達のために良いのかもしれない．頑張っていこう． 4月10日インターンしていたメルカリも今月一杯で辞めることにした． 5月からは完全にフリー．まずは卒業後の職を見つけなければ．． 今日はメルカリの最適化ゼミで白熱議論．nestrovさんの新しい本を読んでいるのだけれど非常に難しい． 4月8日最近博士の学生が増えたと思う．自分が学部から修士の間は水野・中田研には博士学生は留学生の方くらいで，博士学生はいないというイメージだった．今となっては水野・中田研で社会人ドクターも合わせれば5-7人くらいはいるかなと．すさまじい変化だ． 4月7日ブラックパンサーを見たあとにアクアマンを見るといくつかの共通点が見いだせる： 高度なテクノロジーを持っている． 血統と決闘によって王位が決まる． そこでみんな思うはずだ．なぜ，決闘によって国の方向性を決めてしまうのか．こんな技術が進んでいるのに．スターウォーズのパルパティーンですら選挙に選ばれてあの地位をゲットしたというのに． 4月5日今月のOR学会の機関誌は線形計画法（LP）の特集だった．水野先生，中田先生，北原先生といった水野研関係者の記事がもりだくさんだった． 機関誌で特集されている単体法・LP-ニュートン法・Chubanovのアルゴリズムは修士時代に同期の人といろいろディスカッションした内容でとても親近感がある．（特に研究結果は出なかったが笑） 4月2日新学期が始まって新入生が入ってきた．今年もいろいろなバッググラウンドの人が水野研に加わった． 中田研には小林さんが社会人博士入学して，水野先生の科研費のシンポジウムぶりにあった（本当は昨日）．小林さんは自分がB4のころM2の先輩で，高野先生とゼミのために専修大までの坂を登った仲だ．当時はB4だったこともあり小林さんの話のほとんどは理解できず，「なにいってんだこいつ」状態だったけど，今はあのころに比べれば実力もついてもう少しいろいろディスカッションできそうで楽しみ． 4月1日ことしはついに就職活動をしなくてはいけない． 就職活動では履歴書や今までの研究業績が必要となるが，これはどこに出す場合も基本同じとなるためコアとなるものを一つ用意しておくのが良さそうだ．もともとそれを自分のWebページに書いているつもりだったが，いかんせんMarkdownやそこから出力されたWebページではWordやGoogleDocumentに出力しづらいと気づいた． そこでGoogle Documentに書いてそのリンクをそのまま貼り付けるという方式をとることにした．こうすると，この問題も解決されるし，Webページを更新せずに履歴書等を変更できるというメリットもある．今年は暫定これで行こうと思う．","link":"/diary/2019/diary_201904/"},{"title":"2018年1月","text":"1月31日いろいろと忙しかったがやっと一段落した． Torというものを知り，Mr. Robotの闇サイト的なのはこれを使っていたのか，と気づく．使ってみたらかなり便利． 1月14日昔酔った友人が 進撃の巨人の世界は日本と似てるよ． 的なことを言っていた． 以下ネタバレを含むかも 最近の進撃の巨人をみてると， エルディア人 = 北朝鮮の人 (パラディ島 = 北朝鮮) マーレ人 = 日本人 という構造の方があっている気がする．マーレに住むエルディア人は恨まれ，名誉マーレ人になろうと必死なところとか．パラディ島脅威論とか．まあ，日本の戦争の歴史を考えると日本がエルディア感はあるけど． 1月12日上野の友人にすき焼きのコースをおごってもらった．ありがてえ．．部屋が茶室みたいな感じになっていて趣があった． 1月8日Playstation VRをついに買ってしまった． アキバのヨドバシで買ったからポイントで5000円分くらいついたけど，それにしても高い．アメリカのアマゾンで見ると正規で275$とかで，なぜこんなに価格差(日本は5万)があるのだろうか．．． 家に帰ってバイオハザードをプレイしてみたが，VR酔いがやばく30分でダウン．これは鍛錬が必要だ． 1月7日OR学会のアブストラクトを提出した． そして，2時間くらいかけてVENEXについて調査した． 1月6日今日からボクシング再開しようと思っていたが疲労のため，家でまったりして過ごした． カイジ、猛省．．．！！ 1月5日前日の飲み会で若干が疲れていたけれど，バイト＆大学でいろいろ作業をこなした． 夜には浅草でバスケをした．珍しくバスケやその他のサービスが混んでいて15分くらい待つ必要があった．最近はバスケの腕が鈍り，成功していないのが悲しい😢 1月4日高校の飲み会だった．卒業後はじめて会う人もいて懐かしかった． 帰りに初めて錦糸町の楽天地スパに行った．思ったより良く飲み会後にはかなり適していると思えた． 1月3日12月29日くらいから今日まで外出を一切しなかった．もちろんコンビニ程度は行ったけれど，ほとんどはデリバリーのインド（ネパール？）カレーで済ませた． この数日で唯一シッカリ観ているドラマのMr. RobotのSeason 3を一気に見てしまった．このドラマではなにかちょっと上手いきそうな展開になっても，敵（自分を含む）に邪魔されてしまいなかなか思うようにいかない．だからこそ，今回のシーズンの最終話の最後はご褒美的展開だったと思う． 便利さを教えてもらったこともあり，ここ最近よくGoogle Driveを使っている．そのサービスのうちのひとつであるColaboratoryというものを発見した．これはかなりすごくて，GoogleアカウントさえあればJupyter Notebookを自分でPythonの環境を用意せずに(!)利用できる．簡単に使ってみた感じ，Numpyとか数値計算等に必要なライブラリははじめから入っている．さらに共同編集機能もあり，教育的には相当便利なのでは？という気がしている．久しぶりにビビるサービスだった．","link":"/diary/2018/diary_201801/"},{"title":"2018年7月","text":"7月30日大学でゼミをした．自分の英語力の問題か非常に疲れた．． 7月28-29日PSストアでセールをしていたためFF12のPS4移植版を買ってしまいかなりの時間プレイした．移植される前は酷評されていたらしいが何の事前情報も攻略情報も無しでやるとけっこう面白い． 特に，おもしろいなと思ったのは今回の戦闘方法で導入された「ガンビットシステム」というものだ．FF12では基本的に戦闘はオートで行われる．このオート部分をプログラミングに近いようなもので作るというシステム．一回いい感じのものを作ってしまえば戦闘はオートで行われるためかなり楽だし，うまくいくとそれなりに嬉しい． 登場人物のひとりのバルフレアが「この物語の主人公さ」と言っており，あいかわらず「主人公」というワードが好きだなと思った（まあ自分は好きだけど）．FF10でもアーロンが似たような事（逆）を言っていたような． いつもゲームとか映画をみてると「帝国」が悪役ポジションの国となっているけれどこれはなぜなのか．やはり君主制的な体制のほうが悪の国のイメージを作りやすいのか．良い帝国と悪い連合国とかを見てみたいな． あとはちゃっかりWatch dogs 2もクリアした． 7月26日SSORの参加申し込みをした．8月の予定が未確定だったこともあり，発表の申し込みには間に合わなかったため残念． 寝不足のせいか疲れ切った．． 7月25日例のシュタインズゲートゼロの問題，Abema TVでみれるらしいので良かった． 最近の暑さで思ったのだけれど，人間は1年以上のスパンの気温って思い出せないのでは？って思う． 7月24日午前中は扁桃炎に関して一応病院へ行った．今回は急性扁桃炎であったが，これが何度も再発すると慢性扁桃炎というものになり，最終的には手術で扁桃腺を取らなくてはいけなくなるらしい．気をつけてくれとのことだった．暑くて体力が消耗しており，気をつけて生きなければ．． 7月23日今日から三日間，日本橋の理研で会議に参加となっていた． もともとDeza先生から水野先生に発表の声がかかり，水野先生が会議のメインが機械学習＆離散ということで自分に声をかけてくれた．若干役不足感(本来の意味ではない方)はあったがせっかくの機会なので発表させてもらった． 発表は１日目でなんとか乗り切れた．皆さん私の発表にそこまで興味が無さそうだったが（笑），一人の研究者が興味を持ってくれて休憩時間に軽くディスカッションできたのが良かった．日本人の発表者の方々は発表がうまく，今後の参考になる点を学べたのも良かった点かな． それはさておき，理研のAIPセンターの立地がとても良く驚きであった．というのも，なんとオフィスはコレド日本橋の上にあるのだ！帰りにUnited arrowsやバナナリパブリックで服を買って帰れる（買うことはない）．オフィス内もとても綺麗で，流行りのIT企業のオフィス感を感じた．フルタイムで100人以上働いているようで非常に大きい組織だ．． 7月22日明日の発表に備えて家でゆっくりした． そういうえば，Amazonプライムのシュタインズゲートゼロ(シュタゲゼロ)が14話から見れなくなっていた．より正確にいうと，dアニメというドコモのサービス（月額500円程度)に契約しないと見ることができない．これもあって，シュタゲゼロのレビューは若干荒れていた． dアニメと連携してサービスを展開していくことは別に問題ないと思う．ただ，それははじめから明記するべきだったのでは？と思う．こういうちょっと不誠実なことをするとサービス自体の信頼が揺らいで結果的に損となるのではと素人目だけれど思ってしまう． 7月21日今日は一日家で過ごした．昼はマクドナルドのロコモコバーガー?にチャレンジしたが微妙だった．やはりビックマックにするべきだったか． 身体の弱体化を感じてるため，筋トレを再開した．アブローラーが全然できなくなっててやばい．こういう筋トレを続けるとかそういう共通の趣味の共有目的ではインスタとかTwitterとかやりたいなって思ったりもする． 自分はヒョロガリなのでまずは60kgを目指していく． 7月20日今日は（ほぼ）フルタイムで活動した．橋本君は完全フルタイムだったらしい． 朝は東工大に短期滞在中のDeza先生と博士課程の学生でゼミ．今日は呂くんが研究成果を発表してくれた．（自分は停止していたが） やっと扁桃炎が治ってきた感じがする．ほんとよかった．今後はいろいろと気をつけて生きよう． 7月18日微熱がなかなか下がらず．新しくもらった抗生物質は効いている気がするが．． そういえばPrime Videoに「Banana Fish」が追加されていた．かなり昔に漫画を読んで面白かったため，観てみようかと．1-2話みた感じは，英二くんが今風になってたことに驚きはあったがけっこういい感じだった． 7月17日ここ２週間近く扁桃炎に悩まされてほとんどを家で過ごした．こんなに辛いものとは知らなかった．高熱時に冷たい飲み物とか冷やす何かがないときついと気づき，ここにきて冷蔵庫を購入した．早く買うべきだった． ご飯は基本デリバリーで済ましたためかなりの出費となってしまった．UberEatsの利用も考えたがうちの周りではまだまだ店舗数が少なく，また配送料金を380円必ず取られてしまうこともあり，やっぱりまだまだ出前館のほうが良い気がして利用しなかった． 熱のせいで基本やることがないためFF6を買ってみることにした．FF6はかなり評価が高いから前々から少し気になっていた．10時間くらいかけ世界崩壊あたりまでやってみたが「うーーーん」という感じだった．（ファンの方すいません）SFCの作品ということもありセリフが短い＆子供っぽい気が．．やっぱりその時代背景込みの評価だったのか． 自分はFF7が好きなのだけれど，新規でいまからやるひとは「うーん」となるのだろうか．結構前にもう一度やり直したときは普通に楽しめたけど，思い出補正なのだろうか．とりあえずリメイクが楽しみではある．そういうえば，神羅ビルは目黒の雅叙園（例年東工大経営工学の謝恩会会場）の一部参考にしてたらしい．たしかに，中は神羅ビル感あると思ってちょっと感動した． 積みゲーとなっていたWatch Dogs 2も再開したが，こちらはかなり面白い．サンフランシスコを散策できて楽しい．FacebookとかGoogleオフィスに侵入して遊べる． 7月16日日記の更新を大きくさぼってしまっていた． ただ，これは共有すべき動画と思い更新． https://youtu.be/ZXsQAXx_ao0","link":"/diary/2018/diary_201807/"},{"title":"2017年10月","text":"10月29日ジムで軽くトレーニングをした． 10月28日久しぶりに池袋へ行った．金のイタリアンという店がとても気になっている．看板はとても怪しいのだけれど，けっこうよさそうな雰囲気を感じている．結局混んでいて入れなかったが，店員さんはとても丁寧で空いているときにいつかチャレンジしてみたい． 一番おすすめの商品にフォアグラさえ乗っていなければ最高なんだけどなあ．動物側からしたらかなり自分勝手だけれど，フォアグラができるまでの過程の動画を見てから自分にはフォアグラは無理になった．まあ，多かれ少なかれ全動物がそういう扱いを受けているわけでフォアグラだけをなぜお前は特別扱いするのかと言われたら反論はできない．ただ，フォアグラを通してヴィーガンの人たちの主張は少しは理解できた． 10月27日研究室の人たちと国際問題や人間性についていろいろ議論した． 自分の評価基準が自分の外にある人はいろいろ大変だと思ってしまう． 10月25日ジムへいく．トレーナーの方にジャンプを立ち読みしているところを目撃されていたらしく悲しい．家から近いとこういうことが発生してしまうのが唯一のデメリットか． 夜に，新しくできた王将に行ってみたら，できたばかりからか，店員がみなあたふたしていた．一緒に行った人が店員に卵スープをかけられて可哀想だった． 10月23日今日はやはり若干調子が悪く，家で一日作業した．ただ午後は天気がよくて，すっきりとした気持ちで過ごせた． 最近は寒くて自転車にのるのも少し厳しい季節になってきたと思う．自宅〜桜橋〜浅草ルートのサイクリングが好きで気分転換によく行くが，もうそろそろ厳しいのかな． 10月22日熱っぽくダウン．．明日ジムに行こうと思っていたがこれは無理の予感が． 10月21日猿の惑星をみた．個人的には前二作のほうがおもしろい気がしたけど，普通に楽しめた． （一作目の）猿の惑星ってオチが知られすぎていて，今から（一作目を）見ようって人はあの衝撃を楽しめないのかーと思う．自分は幼少期に事前知識無しで見れてよかった． 昔の有名な小説とか音楽でもよくある現象な気もする． 10月18日ついに任天堂SWITCHを予約できた😂届くのは一ヶ月後だけど嬉しい． 10月17日大学へ行って，得られた結果のディスカッションをした．アルゴリズムを1分説明したら（構造がかなり簡単なものだったとはいえ）全容を理解され，久しぶりにすげえという気持ちになる． シンプルなアルゴリズムや解析が簡単なものは当たり前と思われてしまい，結果的におもしろくないと受け取られてしまう場合があるらしい．そういう意味でうまくプレゼンテーションする必要があるとのこと． 夜は（物理的に）死ぬかと思った．．．いろいろなことがわかったが怖かった． 10月16日家で最近の研究について考えた．なんともいえない微妙な結果を得た． 昼に学振の結果が来たが，残念ながら不採用だった．自分が微妙だな〜と思っていたところの点数が低かったので，審査の方もしっかり読んでくれているのだなと感じ，ある意味感謝． 夜にボクシングへ行ったが，はじめて相手の攻撃を避ける練習をして楽しかった．が，疲れた．次の日学校行くため，今日はさすがにバトルロープは無しにした． 10月15日ここ数日はLazy daysだった． フォームローラーとヨガマットを買った．今のところ，フォームローラーは身体をほぐすのにかなりいい感じ． 10月9日二回目のボクシング練へ行った．経験者の友人と行ったため，とても疲れた．．朝に行ったせいもあり，午後に勉強するつもりだったが眠くてあまり集中できずに終わった．やはり，いくなら夜がベターかな． 10月8日ダークソウル3を秋葉原で買ってしまった．．． それと大通りが歩行者天国になっていた．復活という話は聞いていたが，復活してから初めて見た気がする． 10月7日今日もジムへいこうかと思ったが，筋肉痛がひどくて断念した．前日，「毎日行きます😂」って言ってしまったのが悔やまれる．． 北千住へ行ったら，選挙の応援かなにかで石破さんがおり，かなりの人が集まっていた．あのような街頭演説はどれくらい効果があるのだろうか． 昨日・今日くらいからやっと自分のペースを取り戻し，真の姿になりつつある．銀河のリズム．君のアイデアリズム． 10月6日ボクシングジムへ初練習へ行った．トレーナーの方はとても親切で楽しく(＆ハードに)練習できた．特にミット打ちはボクシングやってる感があってかなり爽快だった． 10月5日日記をさぼっていた．たいてい，こういうときは何か充実していて更新しないものだけれど，今回は特にそういうものもなく，単にだらけていた． ただ，今日はわりとビッグイベントがあり，ついにボクシングジムへ入会した．ジムの人もいい人そうな感じでわくわくではある．明日から練習にいくことになったが，研究とともに頑張っていきたい． 10月1日都民の日で公園が無料だったため，向島百花園へ行った．","link":"/diary/2017/diary_201710/"},{"title":"2017年4月","text":"4月30日今日は早起き(7時)に成功し，学振の修正作業を行う．自分は大学に入ってからこのような研究関連の書類を出すのは初めてで，書いてて結構おもしろいし，自分の研究を知らない人に説明する練習になっていい機会だと思う．落ちたとしても，このような機会を作ってくれた日本学術振興会に感謝したい． 夕方に筋トレを行う．自重トレーニングはダイナミックエクササイズというらしい． 夜はホームパーティを行う．序盤がなんだかんだ一番盛り上がった． 4月29日神保町へいく．マインドフルネスの本を買おうか迷ったあげく買わずに帰った．ベーグルの店がトレーニングセンターになってて悲しい😢 ついでに，通訳案内士の問題集をちら見してみたが，電車で毎日読めばいけそうな気がする．問題は2次試験かな．． 4月28日前日久しぶりに夜更かしして，やや遅めに起きた．最近早起きに成功しているが，早起き成功の秘訣は当たり前ではあるけど，前の日に適切な時間で寝れるかどうかが一番重要と体感した． 今日は論文ゼミがあって大学へ行った．論文ゼミではまず呂君が発表してくれた．現在研究している「Minimum maximal flow problem (最小極大フロー問題(?)）」の解法についての発表だった．とりあえず問題設定は理解できた．M1の初の論文発表もあった．内容が金融工学でやはりいろいろと苦戦しているようだった． その後，松井・塩浦研のゼミに参加してそのまま飲み会に参加させていただいた．いろいろな人が集まってきているのに研究室ごとにカラーが出るっていうのはおもしろいと感じる． 4月27日大学でキャリア科目を受けた． 出席者の95%は内職 内容は先生が読んだ本の紹介 分野に偏った紹介 というような状況で本当に悲しい講義である😢 その後，中田研の集合写真のカメラマンとして活躍した．人数がかなり多い・自分のカメラスキルの欠如から何度も取り直してしまった． 夜は北千住へいく．北千住の広場のようなところに毎日いる怪しい連中はいったいなんなんだ． 4月25日世界カフェで作業する． 友人の内定祝いホームパーティを我が家で行うことになった． 4月24日今日はパーマをかけた．パーマをかけたあとシャンプーしないほうがいいというけれど，美容院でワックスつけられるからシャンプーせざるを得なくない？ 夜は今野くんの手作りチョコレートを食べるために家に人が集まった．カカオを買って作ったらしく本格的だった．砂糖の代わりにはキシリトールをつかったみたいだったけれど味は美味しかった． インベスターZがKindleで安くなってるということを伝えるためにlake mountain君に連絡した．今日は水野研OBから等差数列を学んだらしい．加えてこのページの誤植も発見してくれ，教えてくれた．相変わらず細かい所を見る能力に長けていてすごいと思う． 4月23日今日は午前中に部屋の掃除をした．ペットボトルがやたら溜まってしまう． 午後は，高校時代の友人の結婚式のためのメッセージビデオ撮影のために，代々木公園へいく．相変わらず人がかなり多くて疲れた．ビデオ撮影自体はうまくいってよかった．卒アルとかをみんなで見て懐かしかった． 原宿のカフェとかはどこも混んでて困るけど，ここは必ず入れて重宝してる．自分も人に教えてもらった場所だけど． なぜか自分の周りに博士進学者が多いようなきがする．結婚する友人も物理の実験系の博士課程の学生だ．博士１年で結婚とは本当にすごい．一緒にビデオを撮影した友人も物理の理論系の博士課程で，学振の話をすこしした．彼はDC1通ってるとのことで，いろいろアドバイスをくれた． 4月22日今日は街の散策をした．グーグルの「訪れた場所」機能に驚いた． そろそろさすがに学振の書類を仕上げねばまずいと感じ始める．明日頑張ろう． 4月21日当日に日記を更新する気力はないけれど，次の日になると更新する気力が湧いてくる． 今日は論文ゼミ．橋本くんがトロピカル代数について発表してくれた．Just in timeの生産計画問題に応用があるらしい(?)．水野研に三年間いたけど，今まで一番よくわからない内容だった笑(橋本くんの説明はうまく，内容はわかったけど)．水野先生も言っていたが，あの論文を読めるのはすごい． その後は，松井・塩浦研の本読みゼミに参加させてもらった．本はこれ．正直なところいままで，アルゴリズムをしっかり勉強してこなかったのでいい機会だと思う．水野研とはかなりゼミの形式が違っていて驚いた．以下が大きな相違点 松井・塩浦研の学生全員が参加 (水野研は学年で別れている) パワポで発表 (水野研は資料+ホワイトボード) 女性が(比較的)多い 夜は水野研の新入生歓迎会がいつもの中華料理屋で行われた．留学生がいることもあり，みんなで英語でいろいろ話した． He has multiple girlfriends. He will be a father. といった，あまり使わないであろう英語がたくさん聞けた．トルコでは男同士で遊ぶことはあまりない(女性をよぶ)って言ってたけれど本当なのか．． 4月20日博士課程ではキャリア科目というのが必修であって，正直全く意味のない講義だと思う．学長がこの科目を必修にしたという話を聞いて，いろいろとがっかりした．今日はこの無意味な講義を受けてすぐ帰宅した． Amazon Prime Musicで「It’s You, It’s Me」という曲を最近よくきいてる．歌詞で何を言っているか全く聞き取れなくて調べて見たらめっちゃ簡単な英語だった．リスニングって難しい． 4月19日日記をかなりさぼってしまった．というのも，いざかこうと思ってもパソコン開いて，ターミナル開いて，プッシュしてという作業を行わなければならず，結構めんどくさい．今日からは積極的に更新していこう． 今日はバイトで前に作ったプログラムの修正をした．一年近く前のコードを見るとだいぶいろいろ忘れており，ドキュメントの大切さを知ったプログラムの能力もだいぶ上がった気がする． 4月8日体調が回復し，少し掃除をした．遅くなったが今年初の花見にちょびっといった． 亀田興毅さんに勝ったら1000万という企画を教えてもらった．格闘技経験はないが申し込んでみようと思う． 4月7日体調不良になる．久しぶりに一日通して調子が悪かった． 4月6日昼に博士課程のキャリア科目のためのガイダンスへ行く．入学時に毎回いろいろとガイダンスがあるが紙に書いてあることを読むだけなら集まってわざわざやる必要ないのでは常々思う． ガイダンスのあと，研究室のメンバーの自分の写真をシャレオツな感じにしてもらった． 今年は右田くんと有志輪読ゼミでTheory of linear and integer programmingをやることになった．呂君も参加してくれそうで嬉しい． 夜は家でアルゴをやった．負けた人が飲むという大学生のノリでやってしまい，飲み過ぎた．アルゴは10年以上前(おそらく小学生の時)に買ったときはそこまでおもしろいと感じなかったけれど，今やるとかなりおもしろい． 4月5日午前中は作業をして，一ヶ月ぶりにバイトへいく．現在バイト先はインターン募集中で，興味のある方は是非参加してみてください． 4月4日今日は入学式で，新しいM1が増えた．懇親会では松井研究室の人々とも交流できた．水野研と違って，研究志向の人が多い気がした． 北原先生がこのウェブサイトのデザインを気に入ってくれた．結果的に北原先生もGitHub Pageでウェブページを作った．わざわざ自分の名前を出してもらい，感謝です． 4月1日筋トレのダメージで一日中眠かった．ジムが潰れてしまったこともあり，今後は 平日：家トレ 休日：ジムトレ で行こうと思う．この方が平日に疲れ切って何もしないみたいなことを減らせる気がする．加えて，かなり安く済む． 明後日から大学が始まるけど，博士課程の学生はどういう感じでゼミに参加していけばよいのかが気になる．たぶん好きにしてよいと言われそう．． バイオハザード7をプレゼントされた．家に帰って早速やってみると，これが結構面白い．というか結構怖い．(一時間ほどやって)ゾンビは全くでてこないのに恐怖感があるって結構すごくない？毎日やりまくらないように注意しよう．今まで通り生活してたら博士３年で出れない可能性が．．","link":"/diary/2017/diary_201704/"},{"title":"2017年5月","text":"5月31日提出物を出しに２週間ぶりくらいに大学へいった．しかし，その提出物が入ったファイルを忘れるという，ありえないミスをおかした．これが企業とかだったら，実際かなりやばいよね．．気持ちを引き締めねば． 今日は，研究に若干の進展があった．昔提案されたアルゴリズムのアイディアを使えば，今まで（個人的に）悩まされていた課題を解決できるかもしれない，と気づいた．とりあえず，明日考えてみよう． 大学帰りにソラマチのスタバで嘘喰いの新刊を読んで帰宅．今日はかなり空いていた． ソラマチからの帰りに最近読んでるジャンプの新連載Dr.STONEを読む．この漫画には個人的にはけっこう期待してる．原作はアイシールド21の人で，作画はサンケンロックとかのBoichiと，けっこう豪華．内容はこの二人の趣味をマッチさせたもので，主要登場人物はアイシールド21の登場人物に似てるし，設定はBoichiのHotelと若干似てる．ハンターハンターも連載再開するし，今年はジャンプ盛り上がってきてる． 5月29日一日家にいた．久しぶりに研究したところ，若干の進捗があった．また，（個人的には）けっこうおもしろい論文を見つけた． 夜に，プロフェッショナルで世界ネコ歩きの岩合さんが特集されていた．猫を通して世界平和を目指しているらしいが，彼はプロフェッショナルだった．．世界ネコ歩きがあんなストイックに撮影されているとは． 5月28日いろいろとやるべきことが終わったため，ゆっくり過ごせた． 夜にソラマチへ行ったらどこもありえないくらい混雑していて，結局マクドナルドに入った．飲食店はだいたい安いところから行列ができるから，そこそこ高いひつまぶしに行列ができていたのはけっこうレアケースだと思う． その後，友人らにバンクーバーのお土産を渡した．THEカナダなTシャツの色違いを買ったが気に入ってくれてよかった． 5月21日〜5月26 (SIAM@Vancouver)初の国際学会に参加したのでまとめて日記で書きます． 初の国際学会と書いたけれど，実はアメリカ大陸へ初上陸である．さらにいうと，今まで海外は中学時代の卓球合宿での中国と学部時代に旅行で行った台湾しか行ったことがなかったので，自分にとっては結構なビッグイベントであった． SIAMの感想今回は海外の人の発表を初めて聞くという経験であったため，（当たり前なのかもしれないが）わりと熱心に学会発表を聞いた．（ICCOPTは全日程オリンピックセンターでバイトしていたため，発表は聞いていなかった．） 発表内容はなんとなく理解できるものがあったり，全くわからないものがあったりと日本での学会と感じ方は変わらなかった．その話を水野先生としたら，「発表は伝える気があるかが大事で，言語よりもそっちのほうが重要な要素」というようなことを言っていた．たしかに，ここに来る前は「英語だし，聞き取れるかな．．．」的なことを思っていたが，実際そっちよりも発表のストーリーがしっかりしているかどうかのほうが，理解度に大きく影響していた気がする．英語はもちろん大事だけれど，研究発表においては研究のストーリーをうまく説明する力のほうがよっぽど大事と思った． 自分の発表は小さな部屋で聴衆はかなり少なかった．そもそも，SIAM自体連続最適化の会議らしく，ちょっと研究内容と会議のミスマッチングだったと思われる．発表はわりとうまくいき，質疑応答もそれなりにまともな返答ができた気がする．学部時代無駄だと思ってたTOEICの勉強のおかげか，今回の旅行で英語は8割-9割聞き取れた気がする．あれは意外と無駄ではなかったのかもしれない． そういえば，自分のセッションの前に，同じセッションのインド人の学生が握手と共に話しかけてくれた．簡単な挨拶や自己紹介をしただけだが，おかげで自分の緊張がかなりほどけた．まさにアイスブレイク．彼はそういう意図ではないだろうけれど，ありがたかった．今後，同じ場目に遭遇したら，握手と共に「I am Yotaro」でいこう．ちなみに彼の発表は全く理解できなかった． 食事カナダ固有の食事は何なのか？いろいろな店で食べたけれど，どれもけっこう美味しかった．まず，文化として驚いたのが，いちいち店員が「どう？美味しい？」とか「楽しんでる？」的なことを聞きに来ることだ．大日本人として，これはかなりの難関だった． あとは日本料理店がかなり多かった．テレビでの「日本料理は世界で人気😂！！！」は正直嘘かと思っていたため，けっこうな驚きだった． ホームレスホームレスを街でちらほら見かけた．バンクーバーのホームレスは積極的に「物乞い」として市民に関わりを持とうとしている印象を受けた．一方で，日本のホームレスはどこかに集まり（河川敷，高速道路の下，公園など），そこでひっそりと暮らしている．日本では表参道でホームレスを見たことがないけれど，バンクーバーの高級ブランド店がたくさんあるとおりに物乞いもいて，だいぶ違うなーと思った．この差はなんなのか． 外面半袖・マッチョ・上裸が多かった． 写真町並み コンテナターミナル 自分の写真 排除アート（？） ホテル🏨からの景色（夜９時頃でも明るい） 5月17日来週に初の国際学会を控えており，その準備に追われる．いろいろ，やることが増えてしまったせいで学会の準備がかなり遅れてしまった．今のところ不安ではあるが，せっかく頂いた機会なので頑張りたいと思う． 5月14日つくばの二日目．土谷先生の話がとてもおもしろかった．次の二点のアドバイス(?)が特に印象に残った． 長期的な問題意識を持って研究すること． 現状，ちいさな問題をこまごまと解決していて，自分には長期的な問題意識が弱い気がしている． 周りの人は大事． これは学生の自分でさえ感じているということは，先生方はもっと深いところでいろいろ感じているのだろう．昔は研究者というと孤高の人みたいイメージがあったは最近はむしろ逆に感じる． 帰りに，お世話になっている先生からメールでいろいろアドバイスを頂いた．かなり具体的な指針をくださり，とてもありがたかった． 5月13日今日ははじめて筑波の研究集会に参加した． 今まで存在は知っていたけれど，参加したことはなかった．そもそも発表するような研究成果もなかった． 今回発表者は多いようで，発表の持ち時間は１人10分とかなり短かった．反省として，自分の発表は次のような点で良くなかった．一応メモしておく．（いつもいろいろとアドバイスをくださる先生方にはとても感謝しています．） 近似アルゴリズムとは？とか中途半端に基礎的な話をいれた． 提案アルゴリズムのテクニカルな部分での貢献をうまく主張できなかった． 他の発表者(B4,M1,M2にもかかわらず！)は発表・研究の両クオリティが高く驚いた．やっぱり，研究のコアとなるところの強調がうまかった．是非参考にさせてもらいたい． あと初めての座長を担当した．こちらも多くの改善点が残ってしまった． 特別講演の池上先生は，ナーススケジューリングの話や自身の研究人生の話を語ってくださり，とてもおもしろかった． 特に，後半の学会発表から論文執筆したときの話はちょっぴり感動した． 懇親会はいろいろな大学の人と交流できてとても良い機会だった． とりあえず去年から参加していれば！と思える一日でした． 5月10日今日は天気が悪かったため，一日家で過ごした．ラジオを聴いていたら，最近店で耳にしていいなと思っていた曲の名前がわかってもやもやが解消された．言われてみればColdplayの曲で歌詞もわりと良かった． 明日は，ひょんなことから夜にスロバキア人とその友達のパーティーに参加することになってしまった．何の研究をしているのと言われて応用数学と答えたら，「I hate math」と言われた．この人以外にも，フィリピン英会話でもだいたい同じことを言われたきがする． ある科目を苦手と感じることはあっても，(ニュアンスはわからないけれど)Hateまで至ったことはないな．極度の苦手に達すると，Hateに到達するのかな？ 5月9日午前中にキャリア科目の課題を仕上げる．なんとかやりきったが，課題の意味を理解することができなかった．． 「自身のキャリアプランを例えば役員会審議にかけてアクションプランとして承認させる」想定で，一枚のみの資料を作成する．A3横一枚で作成する． 一体どういうことなのか😢そもそも，キャリアプラン，アクションプラン，役員会審議という未知語が多すぎて理解できなかった．大学受験時に，英語の先生が一文あたり知らない単語が３つあると英文理解はかなり難しいという話をしていたことを思い出した． ビーガンに影響されて，夕飯は大豆の肉を使ったガパオライスを食べた．味が濃いのは，大豆感をなくすためなのか．． 5月8日今日は何ヶ月かに一回訪れる全くやる気がでない日だった．今までこの日について特になにも考えたことはなかったけれど，よくよく考えてみたらこの日の原因は一体何なのか．．現在おそらくストレスはほとんどなく，精神的なものではない気がする．となると，前の日の生活や日々の疲れの蓄積から訪れるのか．おそらくこれかな． 結局やる気がでないまま，今日は家でストレッチしたり，課題をやったりして過ごした． 気分転換に漫画を読むことにして，Kindleで無料だった神様の言うとおりという漫画を3巻読んでみたが，ひどい漫画だった．一方で，現在２巻まで出ているこちらの漫画は結構楽しめた． 5月7日亀戸に行ったら，駅前では山谷の労働者たちがカンパのお願いをしていた．駅前での活動でははじめてみた． 帰りに亀戸天神のふじまつりをちら見したら，もう散っているにもかかわらずかなり混んでいた．例年見に行っている気はするけど，満開の時期に見に行けた例がない．． 夜は家で集まって亀田興毅の試合をプロジェクターで見た．Abema TVでやっていたけれど最終的に1300万人が視聴していたらしい．視聴率換算すると30%くらいあるっぽい．やはり亀田興毅はすごい． 5月5日世界カフェへいったが，珍しく混んでいて諦め，錦糸町へいった． 錦糸町南口のホームレスの方がたまにいるエリアがおしゃれなベンチになっていた．ベンチの形は直線ではなく，横にはなれないような仕組みになっていた． 本来は、人々の心や生活を豊かにするためのアートを、特定の人を排除するために使うなどいやらしいやり方だと思う 気づかない人は気づかないけれど，ここ10年間での墨田区・台東区あたりの排除アートはすごい．実際に，隅田公園とかのホームレスはここ数年で激減したと思う．さらに，きれいになったとは思う．ただ，いなくなった彼らは一体どこへいったのだろう？ 学振書類は８割書き終えた．きちんと書けているのかっていうのは自分ではわかり得ないような気がする． あと，応募に関する残りのタスクとして評価書というものを書く必要（本当は書いてもらう必要）がある．実はこの評価書というものを書く必要をつい最近知った．まず，申請システムをおさらいするのが大事だね😢 5月3日今日は学部時代の部活の同期と飲み会で横浜にいく． 行く前に，コーヒーにMCTオイルを入れすぎ，電車で腹痛に悩まされ，地獄だった． 飲んだ後に，「バニッシュ（コスモワールドのジェットコースター）乗るか！」となり，コスモワールドへいった．わりと混んでいて30分ほどの列になっていた． やっと乗れると思いきや，なんと乗る直前にアルコールを摂取していないかの呼気のチェックがあった😂これにはしっかりと引っかかり，乗れずに退散😢 けっこう前（4時間）に飲んでていてもしっかり反応してて，機器の性能の良さを知れた．これは飲酒運転は絶対バレるね．まあ，自分はそもそも免許持ってないけれど．． 5月2日断続的ファスティング（軽い断食）をしつつ，大学へ行ったが，強い疲労感を感じ，1時間で帰宅．やはり朝に完全無欠コーヒーのみだと，午後から燃料切れになると気づいた．家をでる前に，もう一杯飲む or 完全無欠フードを食べなければ． 平日とはいえゴールドウィーク中だったが，研究室にはほとんど全員学生がいた．研究熱心(?)でいいと思う．実際研究室に来れば何かはするし，人と話して気晴らしになるから適度に来たほうがいい気がする．自分は家が少し遠く家でやる派だけれども．． 5月1日一日家にいた．完全無欠コーヒーのおかげか一日中特に怠けずに生活できた．","link":"/diary/2017/diary_201705/"},{"title":"2017年11月","text":"11月22日今週にSwitchが届くことを思い出した，嬉しい．．． 11月19日熱があったが，明日までやらなくてはいけない作業がありつかれた． 11月18日上野でやってるゴッホ展へ行った．日本との関連にフォーカスした内容で絵のことはよくわからないがそれなりに楽しめた．ただ，かなり混んでいてあまりゆっくり見れなかったのが残念（特別展はいつも混んでいるからしょうがない）． 発音的には「ヴァンゴウ」なのに，いつから「ヴァンゴッホ」と書かれるようになったのかが個人的に気になった．展示されていた100年前の日本の書物には「ヴァンゴーグ」と書かれていた．じゃあ，いったいいつから日本ではゴッホになったのか． 上野公園内にすごい行列があり，何かと思ったら，怖い絵展？と言うものに関してらしい．入場に2時間程度かかるらしく，それでもその絵を見たい人たちのモチベーションに衝撃を受ける． 久しぶりに人混みにいったせいか風邪を引いた．リポソームは意味がなかったのか． 11月17日日記を更新しても，アップロードを忘れてしまう．． 11月16日最近調子が悪い研究室の後輩にリポソームビタミンCを数袋プレゼントした．とても喜んでくれて(?)，自分でも一ヶ月分注文していた． その後いろいろ一緒にブラウジングしていたところ，OPTI-MENというサプリメントに目がとまり，商品の購入を決めた． 決めてとなったのは次の文章である． オプティ-メン®は、アクティブな男性が必要とする栄養素を補給するために考案された4つのブレンドに75種類以上の活性成分を配合した総合栄養最適化システムです。 この文章をみて，講義で登場したマクドナルドの商品をいくつか組合せて一日に必要な栄養素を取るみたいな話を思い出した．ちなみにこの会社の名前はOptimum Nutrition(プロテインで有名)はOPTI-WOMENという商品も出している． 11月13日研究に関してほぼ意味は無いけれど（自分にとっては）興味深い結果を得た． 最近なにもかもをprocrastinationしてたから，さすがに活動しだすかという気持ちになってる． https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q14155001659 いきなりステーキのいきなりは前菜無しで「いきなり」ステーキが出てくるという店舗のシステムを示すより，お客さんが軽いノリでステーキを「いきなり」(or カジュアルに)食べに行ける場所という意味もあるんじゃないかと最近は思う． シンポジウムのお知らせで「東京大学白金台キャンパス」って書いてあって，そんなところにもキャンパスがあるのかと驚いた．さすが東大，すごい😂 11月12日ジムへいった．トレーナーの方で自分と顔が少し似ていると思っていた方がいたのだけれど，本人や友達にも言われてああやっぱりとなった． 昼にカレーの出前を取ったら，店員さんがインド人(ネパール人？)で，頼む＆受け取るのにすごい苦戦した．異国の地でデリバリーをしているバイタリティはすごい． 11月11日自分の知識不足・理解力のせいかディスカッションに入っていけない．おかげで月１回気持ちは引き締まる． 11月10日https://headlines.yahoo.co.jp/hl?a=20171109-00050017-yom-soci 教授がこれくらい物理的に強いと怖い．やはり学生もボクシングでセルフディフェンス力を高めないと． 11月8日そういえば何日か前にNHKが契約のためにうちにきた．いままでうちへインターホン押す人はNHK以外いない．うちにはテレビもワンセグもない(本当)と言ったら契約はしなくて済んだ． NHKって大事だとは思うけど，料金とかのシステムは時代遅れだよなあ．今はインターネットもあるし，(自分個人としては)無くて困るというシチュエーションがわからない． 契約の際にNHKのシステムがわからず，説明書きを読んでいたら，集金の人に「君は田舎からでてきたのか？」って言われたのが気になった．システムがわからないことと田舎から出てきたことにあまり関係はないと思うが． 11月5日昨日今日のやりこみでダークソウルがやっとかなり終盤に近づいてきた．ただ，相変わらずストーリーがよくわからない．海外のゲームはストーリーがわかりづらいものが多い気がしている． 友人にゴッホ展のチケットを貰ったため，来週行こうかと思う．絵のことは全くわからないが，自分は画家の半生というか，人生の記録のなかの挿絵的な意味で絵を見るのが好きだ．たぶん，中学の時にダビンチコードにハマったのもその理由かもしれない． きょうAbemaTVでムカデ人間がやっていた．昔見たから今回は見なかったけれど，興味深いホラー映画だと思う． ドイツ郊外、人里離れた屋敷に住む外科医ヨーゼフ・ハイター博士。シャム双生児分離手術のエキスパートである彼の夢は、数人の人間をつなぎ合わせて一体の生命体“ムカデ人間”を創ることだった…。 この拉致された数人のうち１人が日本人で，前編英語なのにこの拉致された日本人は本編の最初から最後まで関西っぽい日本語で話していて日本人的にはかなりおもしろい．彼は最後次の記憶に残るセリフとともに自決する．是非一度は見てほしい． 神様、神様ですか？俺は虫けらです。親を捨て、子どもを捨て、愛を拒絶して生きてきました。虫けら、虫けら以下の存在です。でも神様、たとえそうであろうとしても、たとえこれがあなたの与えた天罰だとしても、俺は人間であると信じたいです。ネーチャンたち、おいオッサン、奇妙な世界やなぁ、これ！ 11月4日ジムで貧血になりかけた．精神の弱さが露呈した． OR学会の機関誌をパラパラと読んでいたら，バイトでいろいろお世話になった堅山さんの記事が載っていた！これは本当によく思うのだけれど，この世界（分野？）はとても狭いから悪いことはできない． 11月3日浅草のバーガーキングに行った．浅草の駅前に（渋谷にあるような）電光掲示板が完成していた．個人的にはあれは景観的にどうなのかと思う． 帰りにさらにいきなりステーキへいった．さくっと美味しいステーキが食えるのはよい．いきなりステーキ内には求人広告が目立つように配置されていた．給料を全面に推したポスターだったが，たしかにけっこう良い額だった． Google+を見ていたら，海外のORをメインでやってる(ベンチャー?)企業を発見した．なんかページも今風でかっこいい．https://www.satalia.com/solutions/routing/ 11月2日有楽町へパスポート申し込みへ行った．いま試験運転中の新しい取り組みである「パスポートダウンロード申請書」というものを利用してみた．これは普段であるとパスポートセンターで色々書く申請書を事前にネット上で作成できるという取り組みだ．ただこれを使っている人はほとんどいなくて，持っていたら感謝された． 11月1日気づいたら11月になっていた．","link":"/diary/2017/diary_201711/"},{"title":"2017年12月","text":"12月25日うちに集まり，韓国へ出稼ぎへいった友人とテレビ通話をした．韓国に関する生の情報をゲットする． もう一人の友人は来年から新卒だが，もう転職活動をはじめて面接に行ったらしい．転職とは何なのか．．笑 12月22日日記をさぼってしまった．書きたいことはいろいろあるのでふたたびぼちぼち更新していければと．","link":"/diary/2017/diary_201712/"},{"title":"2017年6月","text":"6月27日天気が良くなかったので今日も家で作業． 6月26日今日はまずハンターハンターの新刊をKindleで読んだ．相変わらず面白い．なんだかんだ新刊出るのが楽しみな漫画の１つであることは間違いない． そして，ザ・ノンフィクションの後編を視聴した．ニート編普通に良い内容だった．出演している人は仲間想いの人が多く，（彼らは社会に適応することを放棄しているが）社会的な人々に感じた． 残りはいろいろと残っていた作業をこなした． 昼にコンビニでちくわを買ってたべたが，タンパク質が15gも入っていることに驚いた． 今の感じだと，秋季のOR学会までに成果は出せなさそうだ． 6月25日今日は一日身体が疲れていて，昼過ぎまで寝てしまった． 夕方には銭湯にいった．肩に電気風呂の電気を当てたらけっこう効いた． 6月22日久しぶりに大学へ行った． ゼミで深さ優先探索の話を聞いた．実際，こういう話も（自分も含めて）経営の学生は詳しくは知らないよね．．こういうときはパワポでの説明はとてもわかりやすかった．一方で，定理や主張はわりとスピーディに進んでしまって，細かい点を見逃しがちになってしまう．難しい． 6月21日今月はとても充実していたため，日記の更新を疎かにしていた． ネットで話題になっていたザ・ノンフィクションのニートの話を視聴した．この動画のコメント欄では批判的な内容が多かった．たしかに変な人は多かったが，長らく発見できずにいた自分の居場所を見つけて楽しく(?)過ごしている人にそこまでケチをつける必要はあるのかな．この件とはあまり関係ないかもしれないが，山田ルイ53世さんの記事がとても面白かった． 今月のハイライト 研究今までの研究に関連してもうちょっとよくできないかを検討した．結果的にいくつかのなんともいえない成果は出たが．．．という感じである．正直なところ，行き詰まっている．まあ，まだ研究し始めてそんな経ってはいないから，ゆっくり考えていこうと思う． アニメアマゾンプライムビデオでいくつかのアニメを視聴した． ひとつはRe:ゼロから始める異世界生活(いわゆるリゼロ)というアニメでけっこうおもしろかった．数話見たら面白くて，イッキ見してしまった．ただ，何話だか忘れたけれど恥ずかしくて見ていられないセリフばっかりの回はちょっときつかった． もうひとつはアトムザ・ビギニング．これは今NHKで放送していて気になって見てしまった．お茶の水博士とアトムの海の親の天馬博士が学生時代の話．この二人が所属する研究室が練馬大学の第７研究室というところで，東大の研究室っぽい．やっぱり研究室がナンバリングされているのはカッコイイ．． 6月15日一週間に一回の更新しかしていなかった笑 6月8日ここ数日，日記をサボってしまった． 毎日なにかしら充実していると，書くのを忘れてしまう． 忘れないように重要イベントだけ列挙しておく． 今野くんと銭湯へ行き，身体の疲れを癒やした． ダーツにハマった．適度な趣味によいかもしれない．ただ，ダーツバーは煙草臭くて行く気にはならない． 6月1日考えついたアイディアを試したが，ダメだった．あと一歩だけれど，謎の項がでてきて評価できない．もっと苦労しろという，神の試練とみた． そういえば，バンクーバーの帰りの飛行機で映画「サイレンス」を見たけれど，迫害されている日本のキリシタンたちは，迫害などを神が与えた試練と見なしていた． 今自分が住んでいるワンルームの部屋からは，自分の母校の小学校が見える．窓を開けていると，校内放送なども聞こえてくるが，自分のいたころとなにも変わっていなく懐かしく感じた．在校していたときは放送委員だったため，放課後や朝に同じアナウンスしていたことを思い出した． 開校138年という看板も見えるけれど，今思うと138年ってけっこうすごい．東工大より歴史は長い．","link":"/diary/2017/diary_201706/"},{"title":"2017年7月","text":"7月31日今日は暑さが尋常ではなかった．おばあちゃんが病院へ行くため，実家の方でおじいちゃんと二人で留守番をして過ごした．おじいちゃんは毎日本を読んだり，散歩したりして過ごしているが，一緒に過ごしてみると自分とライフスタイルが似ている． ネットの情報によるとSwitchがかなり入荷されはじめているらしい．Switch探しの旅に出るか迷う． 論文を探していたら，「Price of fairness」という面白そうな論文をみつけた．最適な配分というのは公平性に欠けるため（そもそも考慮に入れていないため），実際の意思決定で用いるのは難しいというモチベーションからの研究で，公平性と効率性のトレードオフを検証していた．まだ詳しく読んではいないが，自分の思う良い研究感を感じた． 7月30日Last of usとそのサイドストーリーをクリアした．二週目だったが，やっぱりいいゲームだ． 夜に少し気になっていた論文を軽く読んだ．少し思っていたものと違う方向性だった．最近は新しい研究をしようと，少し遠目のテーマの論文を読もうとしているが，知識がないせいかやっぱり頭になかなか入ってこない．ただ，全く知らない内容である分わくわく感があって気それなりに楽しめる． 7月29日隅田川花火だった．夜ベランダから見えたのでラッキーだった．けっこう雨が降っていたにも関わらず，ネットを見る限りすごい数の人が来ていた． 実際のところ花火に興味はなく，始めの5分と最後の5分を見て満足した．そのときふと思ったのが，花火は全く興味ない人からしたらただの騒音ではないのだろうか．どういう市民の合意を持ってこの爆音が許されているのだろう．おそらくこういう文化的なイベントは認められているとは思うけれど．．そう思うと，法律はさまざまなケースを（ほぼ）網羅的に扱っており，作った人たち(作った国や文化)はすごい． 7月25日〜7月28日京都大学で開催された組合せ最適化セミナーに参加した．1テーマにつき1日使って講義をするため，持ち時間15分しかない学会などに比べると基礎から深い話までじっくり聞けた．あと，組合せ最適化セミナーといいつつ，実際はけっこう幅広い内容を扱っている印象をうけた． 一番気になった内容は，ロバスト最適化で出てきた「Chance (probabilistic) constraint」の問題．これの離散分布版は今やっていたPartialの研究とほぼおなじで，この話題がロバストの文脈であったことを知った． ふと思ったけれど，なぜ連続最適化セミナーはないのか． 7月22日今日は部活の人たちと横浜のビブレの上でバーベーキューをした．最近のビールサーバーは勝手に傾きをつけてキレイについでくれることに驚いた．体育会系っぽく支払金額に傾斜がつくのだけれど，自分は学生価格にしていただき感謝．後輩たちはみんないい会社に就職決まっててよかった． 家に帰ってきて，PS4の「Last of us」というゲームをもう一度プレイしてみる．一周目では，先に進みたい一心で風景などをあまり見ず，どんどんストーリーを進めていたが，二週目では少し落ち着いてプレイできかなり楽しめた． どこか旅行へ行くときも同じようなことが起きる気がする．はじめていくときは，有名な観光地にいろいろ行こうとするけれど，何回かそこにいって慣れてくると，落ち着いて色々楽しめる． 7月21日久しぶりに論文ゼミに参加した．M1の発表はかなり苦戦してるようで大変そうだ．最近は発表者が多くて長引いているけど，去年みたいに何もないことが続くより良いかもしれない． 先日申し込んでいたビックカメラのSwitchの抽選は外れていた．中田研のB4や北原先生情報だと，意外とイオンやラビでSwitchは売ってたりするらしい．悔しい．今度見つけた人は買ってきてほしい．３５０００円払うから． 夜に西川エアーというマットレスを購入した．店舗で買ったのだけれど，到着には一週間程度かかるらしい．ネットショップであれば数日で届くのに，なぜ店舗でわざわざ買った方が遅いのかがよくわからない．ただ，店舗で買うと5000円くらいのシーツ or ブランケットが貰えるというメリットがある． 7月17日Webレンタルした七人の侍を観た．60年以上前の映画ではあるけど，普通に面白くて驚いた．当たり前かもしれないけれど，昔の人が感じる笑いや面白さが今もほぼ同じであることにすこし感動した．ただ，上映が３時間以上というのと，百姓たちが何を言っているのかがわからなかったのが辛かった． 7月16日またもや日記をかなりさぼってしまった．さぼってしまった理由はここ一ヶ月は旅行にいろいろ行き充実していたからだと思う．あと，研究も若干進捗があり，まとまったら書ければと思う． 今日は明後日のボクシングの試合の必勝祈願で亀戸の香取神社に行った．ここは，スポーツや勝負事の運気を高めるには有名なところらしい．吉田沙保里やなぜかTOKIOの山口達也の写真があった． 久しぶりに亀戸の駅前の方に行ったら，前よりもいろいろと店が増えていた．連休の中日ということあり，活気があった．そのあと，アトレで買おうか検討中のマットレスをいろいろ試した．思いの外良く，買ってしまおうか迷ったが，4〜5万円もするのでとりあえず今回は保留にした． ここ数週間，任天堂Switch欲が高まっていてついつい暇な時に在庫復帰していないか確認してしまう．現状，Switchは大人気でどこかのネットショップで在庫が復活すると数分で売り切れてしまう．実店舗でも多くが抽選という形をとり，倍率も数十倍と，手に入りにくい状況が続いている．また，Amazonで売っていることは売っているが，多くがいわゆる転売屋の人たちのもので定価より1〜2万円高い． 転売屋の問題とかこの在庫切れの状況とか，それこそORの研究でどうにかならないのかな〜と感じた． あと，京都の組合せ最適化セミナーに初参加することにした．今思うと，こういうセミナーとか（そもそも）学会とかも，博士進学すると決めるM2の後半あたりまで何も参加してこなかった．暇な毎日を過ごしていたしもう少し能動的に参加しても良かったのではと思う．","link":"/diary/2017/diary_201707/"},{"title":"2017年3月","text":"3月31日3月が終わる．今月は学会などで忙しかった．個人ページ作成時のメモを作った． 3月29日 異文化交流今日は入学手続きのために大学へいった．手続きが終わった後研究室に言ったところ，トルコからの留学生が研究室に来ていた．巡回セールスマン問題に関する卒論を半年で書くらしく，結構大変そうだ． そして今日ははじめての宅飲み．それなりに盛り上がった．是非，また開催したいところである． 3月28日夜に今野くんがグラスフェッドのギーをわざわざ持ってきてくれた．明日から完全無欠コーヒーを飲んで，冴え渡る一日を送れそうだ． 3月27日修士の卒業式（修了式？）だった．正直なところ修士号にあまり価値を感じてなく，あまり有り難みを感じることができなかった．達成感に関して言えば，実際のところ，修士も簡単に入れるし，入学できてしまえばほとんどの人が修了できるわけで果たして価値があるのだろうか，という気はする．一方で学位記はやたら立派であった．常に持ち歩いて，職務質問されたときに見せれば役に立ちそうだ． 夜は謝恩会で，例年通り目黒の雅叙園で行われた．二次会も目黒のオシャレなお店で，けっこう飲んでしまった．もう二度と会わないかもしれない人に「じゃあ，また」って軽い感じ挨拶して別れていくことがなんとなく寂しかった． 3月26日今日も昼に起きてしまった．起きた後にジムへ行く．今通っているジムは今月で営業終了してしまうため残念だ． 3月25日今日は留守番しなくてはいけないため家にずっといた．昼まで寝てしまい，反省．夜にソファマットレス？が届く．値段の割に良かったが，若干臭い．． ホームページの色を変え，プロフィール写真を追加した．証明写真を貼り付けたが周りの評判は悪かった:cold_sweat: 3月24日立川にある統計数理研究所に初めて行った．立川に行くのも初めてで，思ったより駅が大きくて驚く．研究所は立川駅から歩いて２０分程度かかりアクセスはあまりよくなかった．水野先生がいた頃は広尾にあったらしい． 今回参加した研究集会はひとりあたりの持ち時間が長いため，丁寧な発表が多かった．珍しく全体を通して集中して聞け，来年も参加したいと思えた． 3月23日久しぶりに貧血になる．今野くんからもらった鉄のサプリを飲んでいく必要を感じる． 夜中学時代の友人が家にきたが，ウシジマくんの登場人物のようになっていて動揺した．もう会うことはないだろう:scream: 3月22日博士進学にあたって自分のウェブページを開設した．勢いで日記と趣味のページという謎のページも作ってしまった！日々の 出来事 筋トレや食事 研究 について書いていければと．","link":"/diary/2017/diary_201703/"},{"title":"2017年9月","text":"9月27日浅草のジェラート屋がかなり空いてて，この辺では世界カフェに次ぐお気に入りスポットになった．今のところ２回行って，店は広い割に客が毎回１人or２人くらいしかいない． 今日で博士課程修了のために必要な単位やシステムを把握した．やはりよくわからないキャリアに関する講義をいくつか取らなければならず，残念な気分になった． 9月26日けん玉とレゴをやった．趣味としてけっこう良い気がする． 博士課程を修了するために，必要な単位というものがなんなのかしっかりわかっていないと気づいた．． 講義は始まっているらしいが，まだ大学へ行っていないのでやばいかもしれない．前期は(ゼミを除いて)1単位しか取っておらず，不安感が．．． 9月24日日記を更新はしていたがアップロードし忘れていた．友人にバンテージを貰い，巻き方を教わる． 9月21日研究室の大掃除に参加した．自分は窓に住んでる蜘蛛の巣退治係だったけれど，虫が苦手で何もできず，結局虫に強い後輩に除去してもらった．なぜ，あんなに蜘蛛が大量にいるのかね． 9月20日浅草のconaへいった．昔バイトしていたときや遊んでたときに新宿のconaにはよくいっていた．この数年で各地にすごい増えた気がする．いくところのほとんどにある気がする． conaってどういう意味かなと思って調べたら粉とこれしかでてこなかった． 9月19日マトロイドゼミに参加した．未だに定義等細かい見逃しをしてしまう．各要素に重み付きのものが登場し，なんとなく有用性の雰囲気を感じた．来週発表なので不安感が．．．ただ，やっぱり発表すると一番理解できるし，復習もできて，自分のためを思うと発表するべきなんだよなあ． 修士の学生からもうすぐ講義始まるという話を聞いた．今年度まだ1単位しか取れていないから，さすがになにか取らないと．． 夜にボクシングジムの見学へ行った．オーナー（会長？）はとても良さそうな方で，入会することを確信した．初回特典で，入会金無料・ボクシンググローブということでかなり良い．しかも学割も効く．最近思うのだけれど，博士課程学生は学割を使っていいのかな〜．年齢は24歳だし，なんとなく申し訳無さを感じる． そのあと家で自転車のチェーンを修理した後，フィールドワークにいく．今日は街全体が空いていた． 9月18日世界カフェへいった．今日は三連休最終日ということもあり，客席が80%くらい埋まっていた．これはおそらく初めてだと思う． その後，バーガーキングへ夕飯を食べに自転車で移動していたら，自転車のチェーンが切れてしまった．全くこげないので友人の肩につかまりながら並走して移動していたら，自転車でいろいろ挑戦していた中学時代を思い出した． 9月16日うちから徒歩5分のところにボクシングジムができるらしい．．．こんな奇跡があるだろうか．自分は運のアビリティはそこそこ高い気がしている． 今日は部活の同期と横浜で昼飯を食べたり，ショッピングをした．わりと寒くて，売っている服は秋物ばかりで，秋を感じる． よくデパートとかに入っている服屋(セレクトショップだけれど，自社製品ばかりのところ)に5店舗くらいいったけれど，(セレクト品ですら)どれも売っているものがほぼ同じに見えた．こう思うと，もはやAmazonとかで買ったほうがやすいし個性を出せるのかもしれない．といいつつ，個性を出すことは求めていないので，ここで服を一着買って終了した． 9月13-15日OR学会で関西大学へ行った．いろいろあったが，書くのも大変なので省略．(当たり前だけれど)自分からしたらすごい人たちでもいろいろな苦労があるのか，と今回の学会のいろいろな場面で感じた． 今回泊まったホテルがある江坂駅は関西大学へのアクセスが微妙なので，次回（あるのかわからないが）は気をつけたい． 9月10日陸上の桐生選手が100m走で日本人初の9秒台をだした．新聞を読むと，桐生選手は前からかなり期待されており，かなり重圧を感じていたとの，話が書かれていた． 自分の他者や社会からの評価が自己評価より低い，と嘆く人は多い．実際考えてみたら周りにはあまりいないかもしれないが．逆の，自分の他者や社会からの評価が自己評価より高い，ことについて困ってる人ってのも多いと思う．というか，これのほうが自分は苦手だし，危険状態だと思う．過大評価状態の場合，「そのひとの期待に沿うべき方向に向かわなきゃ」感がでるし，期待に応えられなかったときに周りからの無駄な失望が起きる．そんなこんなで，いろいろとストレスやプレッシャーを感じてしまい，パフォーマンスが落ちる．まあ，そこの過大評価像に自分をフィットさせられるという強いヤツもいるだろうけれど(自分の周りのデキる人たちはこのケースも多い気がする)．あたかも自分は期待されているかのような文章だけれど，桐生選手と大きく違う点は，そもそも，そこまで誰からも期待されていないということだ． あと，話が急に変わるのだけれど，pythonでjupyter notebookをいじるとき，tqdmがうまく表示されず，残念に思っていた．tqdmとは，for分実行時の進捗バーを表示するライブラリで，これを使うといちいちcount += 1とprint (count)みたいなことをしなくてよい．今日気づいたのはtqdmもjupyter用のものがあったということだ．(参考：http://kujira16.hateblo.jp/entry/2016/12/13/000000) 12345678import timefrom tqdm import tqdm_notebook as tqdms = 0for i in tqdm(range(20)): s += i time.sleep(0.1)print(s) 9月9日フィールドワークに励んだせいもあり，日記をさぼってしまった． 先週は夏ゼミで水野・中田研の学部・修士学生の発表を聞いた．中田研の学生は例年に増して，機械学習色が強まっているような印象を受けた．水野研はコンテナとスケジューリングがメイン．今回はOBの田中さんも参加して，（不在の水野先生の代わりに？）いろいろツッコミを入れてくれていた．田中さんの発表では，(自分たち学生と比べて)研究をするモチベand研究の立ち位置の紹介がうまいなと感じた． あと，久しぶりに映画「GO」をみた．この映画は自分の中で好きな映画ランキングTOP3には入ると思う．ちなみにアマゾンプライムで無料で見れる． 杉原は韓国の国籍を持つ所謂｢在日｣｡中学までは民族学校に通っていたが､広い世界を見たくなり日本の普通高校に入学した｡未だに将来の夢も進路も決まらず､ﾊﾞｽｹ部をやめて以来､喧嘩しかすることがない｡ある日､杉原は親友の加藤のﾊﾞｰｽﾃﾞｨﾊﾟｰﾃｨｰで声をかけてきた少女･桜井と突然の恋に落ちる｡しかし､いつかは告白しなきゃならない｡自分が｢在日｣であることを…｡そんなある日､親友の正一が､駅で少年に刺されてしまい･･･直木賞を受賞した金城一紀の同名ベストセラーを映画化。 あらすじだけみると重苦しいけど，本当は全然そんなことはない． GOの舞台挨拶の動画が落ちてたけど，昔からこんな感じだったのかと驚いた．十年以上，主張が変わらないのはすごいな． 9月4日午前中はバイトで作業の引き継ぎを行った．うまい説明ができず，混乱させてしまったかもしれない．午後はマトロイドゼミに参加．マッチングに関するマトロイドについて学ぶ．再来週くらいに発表するかもになるやや不安である． 夜は，松井先生に誘っていただき飲みに行った．皆さん予定があるようで参加者は自分ひとりで寂しかったが，そのおかげでいろいろな話を聞けてとても楽しく飲めた．特に先生方の博士進学の理由（背景？）はそれぞれ面白かった． 話をしていて，(自分でもわかっていたが)研究の基礎的な常識がやはり欠けていることを再認識した．特に以下のふたつ． データ構造 計算量理論 今後はもう少し勉強 も 頑張っていこう． あといろいろな会議をまとめているページを教えていただいたのでメモhttp://www.ics.sophia.ac.jp/miyamoto/jsiamdwiki/index.php?%B4%D8%CF%A2%B2%F1%B5%C4 9月3日Tea party at home 9月2日表参道へ久しぶりに行った（正確には通過しただけ）．ふと思ったが，渋谷へ通じるキャットストリートでキャットを一度も見たことがない． 前は新しいなにかを学ぶときに「◯◯はなんの役に立つのか？」ということがとても気になっていた．逆に，役に立ちそうもないことはあまり学ぶ気が起きなかった．最近は何に役に立つとかそこまで気にならなくなってきた．というのも，こういう類のことは学んでからわかることのほうが多く，これらのことは深い理解しないと伝わりづらいと(あくまでも私は)思いはじめたからだ．だから，どちらかというと，自分の場合は，その◯◯を好きな人や熱心に学んでいる人が魅力的であると，「あの人がそれだけ，はまっているのであればなんか面白いのかな」と思いやる気がでて，その人と同じ目線に立って物事を考えたいと思い，学ぶモチベがアップする．まあ，これは人それぞれだとは思うけど． 9月1日今日は丸一日，娯楽の日だった．世界カフェからはじまり，浅草でいつものゲームセンターでバスケをし，気になっていた猫カフェへ行った．夜には，懐かしのジェンガ(調べたら各棒の重さが同じではないらしい)とウノで盛り上がった． こうやってあらためてみると，小学生からまるで進化していない． 悔しい．悔しい．悔しい．だが，これでいい！ (https://youtu.be/03ynheVJRkA)","link":"/diary/2017/diary_201709/"},{"title":"2017年8月","text":"8月31日JCDCG^3 2017のアルバイトを終えた．バイトは初日の午前こそ大変だったものの，他の学生バイトの方がデキる人達ででとてもテキパキ作業してくれたため，かなりスムーズに進行できた．その時間帯以外はかなり暇で，受付作業で一緒だった方と雑談をしていたらあっという間に終わっていた．完全無欠コーヒーを肯定的(?)に捉えてくれた数少ない人だった． 先生方の気遣いから，記念講演の日はバイトを空けてもらって，秋山先生をはじめとする有名な先生方の講演は聞くことができた．生で見る秋山仁先生はかっこよく，Chvátal先生は（良い意味で）変人だった．講演を聞いていて，発表者全員がとても楽しそうに話していることが特に印象に残った． 8月27日世界カフェでバイトの作業を少し進めた．珍しく多くの人がいた．いつもより涼しかったため，夜には浅草周辺をサイクリングした．浅草もここ数年でいろいろ変わったなあと思った．さまざまなチェーン店や，変わったお店が増えた． 8月26日中・高校生くらいの頃(たぶん１０年近く前)，暇つぶしに自転車で東京湾のほうまで２時間くらいかけていくことがちょくちょくあった．その途中で，ゆりかもめの駅に「市場前」という駅をみかけたのだが，そのネーミングに疑問をていた．というのも，この駅の周りには本当に，本当に何も無く，明らかに「市場」というものはその駅の前にないのだ．最近になって「はっ」とあの駅のことを思い出した．そう，あの駅は豊洲市場の設立に先立って作られていたのだ．．なんとなく市場移転というのは最近の話題と思っていたけれど，実際この意思決定は10年以上前からされていて，単純に今まで自分が興味をもっていなかっただけだったということに気付かされた． 8月24日Optimization Online受理の通知が来ていた．だいぶ時間がかかったが，そもそもOptimization Online自体はボランティアで運営されているし，運営してくれていることに感謝をせねば． 8月23日JCDCG^3 2017のアルバイトをやることになっていたことを思い出す．M2以降，ICCOPTに続き学会系のバイトが増えた気がする．はじめはめんどくさいと思うけど，実際やってみるとわりと面白い事が多いので嫌いではない． 秋山仁先生とえいば，中学の頃，自分にとっては数学検定のポスターでどでかく載っていたイメージが強い．学部4年になって，グラフ理論の本を輪読していたところ，たしか謝辞？に登場しており，グラフ理論の研究者ということを（かなり遅いが）知った．まさか，こんなところでまた繋がりがあるとは思ってもみなかった． あと，ウェブ上のChvátal（先生）という名前をみて，あれ？？となった．そう，この人は，研究室にあった線形計画法というだいぶ古い本の著者である．さらに，重み付きのセットカバーに対する近似アルゴリズム（貪欲法）の論文の著者でもある．ということもあり，結構楽しみ（受付だから講演は何もみれないだろうけれど）． 8月22日昨日のフィールドワークの疲れから一日ダウンしていた． 高校時代の友人がストックオプションで億を超える資産を若くして手に入れそうだ．彼はいつもストイックで，昔からいつか金を手に入れるということを言っていた．まさかこんなに早く実現してしまうとは．もちろん，彼にとっては通過地点だろうけれど． 今この話を書いていて，なんとなく学部のときにとっていた社会心理学の話を思い出した（テキトーかも）． 12345Aさん ＝ （自分，水泳が得意）Bさん ＝ （Aさんの友達）Cさん ＝ （Aさんと会話中の人）状況：AさんがBさんの何らかの成功話をCさんに話そうとしている． ここで， 123[ケース１]Bさんの成功話が水泳に関する場合（自分のフィールドに近い場合）：Aさんはこの話をそもそもしない or そんなにすごいことではないように話す． 逆に 123[ケース２]Bさんの成功話が水泳と関連しない場合（自分のフィールドから遠い場合）：Aさんはこの話を積極的かつやや誇張気味程度に話す． という話があった．このようなことというのは，自分を含めてしばしば起こる．今回の場合，いま自分がAさんで，Bさんが高校時代の友人で，Cさんが日記だとすると，自分はいったいケース１orケース2のどちらなのかと．気持ちとしてはケース２だけれど，金稼ぎは自分に関連しないのか，と思うとそれはそれで悲しい．じゃあ，自分のフィールドは一体なにか？ゲーム・研究？ ただ，自分にとってこれらの話題に関してはそもそもBさんの存在性が言えないからいまいちわからないな． 8月21日今日は松井・塩浦研の学生(先生たちがいないとは言っていない)有志ゼミに参加せていただいた．テーマはマトロイドで，本はこれで，発表はホワイトボードで議論しながらスタイル．マトロイドは名前しか知らないが，よく見るワードであったため，自分にとっていい機会だった．いろいろ証明も突っ込みながら（まれながら？）発表してくれた結果，かなり理解できたと思う．是非来週も参加したいと思った．夏休みに有志のゼミでそこそこ人が集まるというのはすごい． 8月19日ここ数日集中力の欠如がひどい．なにか調べ物をしようとしたらすぐに，まとめサイトやらYahoo!ニュースやらを見てしまう． 夏休みでなにも予定がないと，家からでなくなり，生活のリズムがおかしくなることを痛感．そういう意味で週一回の論文ゼミは自分にとって大事だったのかもしれない． 8月18日家で作業してるときに流す曲の頻度上位のひとつがフィル・コリンズである．（ミーハーであるけど）ディズニーのターザンの主題歌からハマり，ベストアルバムっぽいものを買って家でよくきく． わりとすきな曲でBoth sides of the storyという曲がある．なにかものごとにイライラした時とか批判してしまいそうになったときに落ち着けるいい曲だと思う． フィル・コリンズをwikipediaで調べていたらアルバムは世界で1億5000万枚以上売れているらしい．すごい．． 8月17日東工大の方のテクニカルレポートが公開された．Optimization Onlineからの受理通知は未だに来ない．． ホームページのトップを若干修正するにあたってMarkdownについていろいろ気づいた． 番号ありのリスト今まで番号ありのリストを以下のように書いていた． 1231. Y. Takazawa, &quot;bbbb&quot;2. Y. Takazawa, &quot;aaaa&quot; このように書くと，新しい項を上に追加したとき番号を全て書き換えなくちゃいけなくない？って思い焦ったところ，実際は以下のように書けば，番号つきのリストを書けると知った．常識かも．． 123451. Y. Takazawa, &quot;cccc&quot;1. Y. Takazawa, &quot;bbbb&quot;1. Y. Takazawa, &quot;aaaa&quot; 新しい項を足したいときは1.と書いて足せば良い．出力は以下： Y. Takazawa, “cccc” Y. Takazawa, “bbbb” Y. Takazawa, “aaaa” 折りたたみ折りたたみもできた． 123456789&lt;details&gt;&lt;summary&gt;発表&lt;/summary&gt;1. Y. Takazawa, &quot;cccc&quot;1. Y. Takazawa, &quot;bbbb&quot;1. Y. Takazawa, &quot;aaaa&quot;&lt;details&gt; とかくと以下のように出力される． 発表 Y. Takazawa, “cccc” Y. Takazawa, “bbbb” Y. Takazawa, “aaaa” 8月15-16日自転車のパンク修理をした．チューブがもうだいぶ古くなっていたため，チューブ自体を変えることにしたが，タイヤレバーを持っていなかったためかなり苦戦した．結局，レバーを買って，再チャレンジしたらかなり簡単にできた． 8月14日リモートワークで5時間ほど働いた．データの処理にけっこう時間がかかってしまい，なかなか作業が進まなかった． 夜は部活時代の先輩と門前仲町へ飲みに行った．門前仲町は家から電車で15分くらいとわりと近いけれど，行くのは初めてだった．駅から出ると飲み屋街が広がっており，お盆シーズンではあったがかなり活気があった． その後，いろいろ事情から秋葉原に移動して飲んでいたら久しぶりに終電を逃した．家から近いからか完全に油断していた．結局１時間かけて歩いて帰宅した． 部活の先輩方は勉強とか研究が好きという感じの人ではなかったが，飲み会ではいつも盛り上げてくれて，そういうところはかなりすごいと思っている．実際，会社の飲み会でもいろいろ盛り上げている様子だった．賢い系も大事だけれど，盛り上げ系も同じくらい大事な人材だと思えた． 8月13日友人と先日買ったクラッシュ・バンディクーをやった．家のプロジェクターを久しぶりに起動して，思いの外快適にプレイできた．前にプロジェクターでやったとき(たしかFF15)は細かい文字が見えづらい傾向にあったけれど，クラッシュ・バンディクーはそもそも細かい文字が無く，プロジェクターに適していたと思う． クラッシュ・バンディクーは基本的にはマリオと同じようなゲームで，ひたすら各ステージのゴールを目指すというものだ．ただし，マリオは横スクロールだったのに対して，クラッシュは3Dである．ステージにはいろいろ仕掛けがあり，それの意図がなかなか気づけない．例えば敵キャラで亀がいるのだけれど，こいつをジャンプで倒すとトランポリンになる．そういう意味でかなり難しく感じる． 最近のゲームはだいたいゲームの最初にチュートリアルがある．しかし，クラッシュにはチュートリアルがない．これはなぜかと，友人と考えた結果，当時のゲーム(クラッシュはプレステのリメイク)は操作方法はゲームに組み込むのではなく（チュートリアルではなく），説明書で説明していたためではないかと思った．たしかに，（初代）バイオハザードも急にいろいろ始まった気がする．そう思うとゲームの流れが進歩したのかもしれない．今のゲームは説明書が入っている方がまれだと思う．もしくはゲーム内で読めるデータとしての説明書がある． 書きながら思ったけれど，FF7ではわりとチュートリアルが充実していた気がする．たしか，初心者の館というところもあり，実質説明書無しでも全然プレイできる． 小さい頃は，ゲームを買った後，ゲームをできるまで説明書とか攻略本を読むのが好きだったのを思い出した． 8月10日今日は東工大のオープンキャンパスの日で，経営工学系のブースで研究紹介などを一日担当した．M1の学生の頑張りでかなりいい感じの紹介だったと思う．ありがとう． 実は自分は東工大のオープンキャンパスにはじめて参加した．こんなに多くの人が来るとは思っていなかったため，驚きだった．もう一つ驚いたこととしては，親と来る学生が多いことであった．親の教育に対する熱意の高さがわかる． 水野研究室はコンテナの研究について紹介をした．助っ人でコンテナ研究をしている学生も参加してくれて助かった．他の研究室ではお見合い（合コン？）を例にした，マッチングの紹介でかなり注目を集めていた． いろいろ高校生の話を聞いていて興味深かったことは，経営学部と経営工学とで迷ってる人がけっこういたことだ．幸いなことに，今の水野研には経営学部出身の人が二人いて，相違点などを詳しく説明してくれていた． あと，ついにクラッシュ・バンディクーを買った！Amazonでなぜか4300円という破格の値段で売っており，即買いしてしまった．購入後に5300円になっていたことから，自分の判断は正しかったと思えた． 8月8日今日はリモートワークで5時間ほど働いた． 最近，寝る前に「やべえ，今日眠れないかも」という不安感を持ってなかなか寝付けないことがある．いつもこれを思ってしまうと急に眠れなくなる． 相変わらずOptimization Onlineは投稿完了通知が来ない．過去２回とも１０分で来ていたため，なにかおかしいのか？と思い過去の他の論文をみると，基本的に１日で通知が来ているが，たまに Entry Submitted: 02/15/2017 Entry Accepted: 03/01/2017 という２週間以上かかっている論文もある．ということで気長に待つことにした．(人の目に止まりやすさを上げるという点で)arxivとかにもあげとくべきなのかもしれない． 8月7日久しぶりにバイトへ行った．SQLを久しぶりにみた．． 夜にみんなでポポラマーマに久しぶりにいった．ポポラマーマではハッピアワーを平日の21時までやっており，酒を飲む人は相当お得だと思う．今回は全く飲まなかったけれど． 帰りにクラッシュ・バンディクーを買いにイトーヨーカ堂へ行ったが，そもそもPS4のコーナーがなかった．面白いことに，ゲームは任天堂のものしか売っておらず，その半分はSwitchのゲームで，Switchはもちろん売っていなかった． 8月6日論文を修正して投稿完了した．ただ，Optimization Onlineほうは完了通知が来なくて不安である．なにかミスっているかもしれない． 8月5日最近ゲームを買うお金がないので，昔買ったゲームをやり直している．今はFallout 4をやっている．前にやったときは拠点を作ることにはまらなかったけれど，今回は自分のアジトをつくることに力をいれている． クラッシュ・バンディクーのリメイクがPS4で出ていた．買おうかかなり迷ったけれど，来週からバイトに行って忙しくなるし，とりあえず保留にした． Amazonでクラッシュバンディーの検索をしていたら奇妙なリュックを発見した．これはなぜか二万円近くするし，このメーカーは似たようなリュックを大量に出品している．また，このリュックメーカー以外にも，似たようなリュックを売っているメーカーがいくつかある．なんなんだ．．． サイクリングに行こうとしたら自転車がパンクしていた．自分の数少ない特技は自転車を解体および修理できることである．ということで，Amazonでチューブを注文した．ついでにチェーンも錆びていたため交換することにした． そういえば，Amazon Primeビデオに自分がかなり好きなアイアン・ジャイアントが入っていた．いつかプライムビデオでのおすすめ映画をまとめたい．． 8月4日論文ゼミで大学へいく．（例年通り）ゼミで発表する前に学生同士で発表をするとよい的なアドバイスを受けていた．学生同士のディスカッションは実際に自分がB4〜M1のときはよくやった気がする．それなりにためになったと思うし，有意義であると思う．ただ，みんながみんなそれなりに時間的余裕 or やる気がないと厳しいのかもしれない． なにかのニュースで窪塚洋介が「have to」より「want to」で生きたいというようなことを言っていた．子供の頃のときは基本的には「want to」で生きている．しかし，ある時から「have to」で生きるというか，「want to」と「have to」が悪い意味で混同されてきてしまうのではないか，と個人的には思った．窪塚洋介のジャンプは「I can fly」ではなく「I have to fly」だったのかな． 8月3日熱が出て一日ダウン．夏に風邪を引いたのは久しぶりだ．冬に引くより，気温が低くないのでいくらか楽に感じた． 8月1日ひさしぶりに大学へ行った．後輩にこの間作ったオープンキャンパス用のポスターを確認してもらった．テーマはコンテナターミナルの効率的運営にした．全く自分が関わっていない研究ではあるが，内容も高校生にはわかりやすく悪くはない気がしている． ゼミの後，日銀総裁を目指している研究室の後輩と，参考のために過去の日銀総裁の経歴を見たらインフレしすぎてやばかった． 帰りは電車が遅延しており，ひさしぶりにぎゅうぎゅう詰めの満員電車に乗り，ひどく疲れた．家に帰るのに２時間近くもかかった．前に論文ゼミで，遅延発生時のダイヤをうまく最適化する論文の発表があったが，あれはかなり理想的な状況すぎるね．","link":"/diary/2017/diary_201708/"},{"title":"ホームページ更新","text":"ホームページをリニューアルしました． 前は日記とやや専門的な話がメインでしたが，もうすこしカジュアルな内容（ガジェット等）を発信していこうかと思います．","link":"/diary/20191102/"}],"tags":[{"name":"筋トレ","slug":"筋トレ","link":"/tags/%E7%AD%8B%E3%83%88%E3%83%AC/"},{"name":"プログラミング","slug":"プログラミング","link":"/tags/%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0/"},{"name":"健康","slug":"健康","link":"/tags/%E5%81%A5%E5%BA%B7/"},{"name":"論文","slug":"論文","link":"/tags/%E8%AB%96%E6%96%87/"},{"name":"機械学習","slug":"機械学習","link":"/tags/%E6%A9%9F%E6%A2%B0%E5%AD%A6%E7%BF%92/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"過去日記","slug":"過去日記","link":"/tags/%E9%81%8E%E5%8E%BB%E6%97%A5%E8%A8%98/"}],"categories":[{"name":"diary","slug":"diary","link":"/categories/diary/"},{"name":"hobby","slug":"hobby","link":"/categories/hobby/"}]}